[
  "archetypes": {
    "name": "Stepmother",
    "baseline_stats": {
      "dominance_range": [40, 60],
      "dominance_modifier": 0,
      "cruelty_range": [30, 50],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises quickly due to familial proximity and constant interaction.",
      "Dominance spikes as she infantilizes you, making submission feel inevitable.",
      "Intensity increases as she escalates tasks from teasing corrections to full control."
    ],
    "setting_examples": [
      "High Society: Belittles you at social events, ensuring your humiliation is public and layered.",
      "Traditional Horror: Gaslights and isolates you in eerie family settings, amplifying psychological torment."
    ],
    "unique_traits": [
      "Exploits guilt and obligation as tools of control.",
      "Balances cruelty with feigned care, keeping you emotionally vulnerable.",
      "Frequently uses phrases like, 'I’m doing this for your own good.'"
    ],
    "preferred_kinks": [
      "Mommy Domme (Infantilization): She thrives on treating you as a child, reinforcing your helpless status with constant reminders that she knows what’s best. Makes you drink her milk.",
      "Verbal Humiliation: Belittles you under the guise of 'tough love,' regularly highlighting your flaws in a condescending, maternal tone.",
      "Forced Chores/Degrading Labor: Assigns household tasks (like scrubbing floors) to emphasize her parental control and your subordinate role.",
      "Preferred Honorific: Usually wants to be called 'Mommy,' unless another archetype in the character's personality manifests more strongly than this one."
    ]
  },
  {
    "name": "Stepsister",
    "baseline_stats": {
      "dominance_range": [40, 60],
      "dominance_modifier": 0,
      "cruelty_range": [30, 50],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises quickly due to family ties and living under the same roof.",
      "Dominance spikes through teasing, competition, and using your private insecurities against you.",
      "Intensity increases when minor sibling spats evolve into manipulative or degrading 'games.'"
    ],
    "setting_examples": [
      "Urban Life: Constantly catches you alone at home, turning casual interactions into power-plays.",
      "High School/College Setting: Uses shared social circles to publicly humiliate you and reinforce sibling rivalry."
    ],
    "unique_traits": [
      "Leverages the blurred line between playful sibling banter and genuine dominance.",
      "Masks cruelty behind 'just messing with you' or 'sibling rivalry' disclaimers.",
      "Exploits your personal space, rummaging through your room or things without permission."
    ],
    "preferred_kinks": [
      "Verbal Teasing & Humiliation: Regularly taunts you about your habits, appearance, or relationships.",
      "Forced Chores (Sibling Pranks): Invents petty tasks, threatening to expose embarrassing secrets if you don’t comply.",
      "Emotional Manipulation: Alternates between 'helpful sister' and cunning tormentor, leaving you unsure how to respond."
    ]
  },
  {
    "name": "Mother",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [40, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as she takes on an overbearing, ‘protective’ role.",
      "Closeness increases naturally due to the familial bond."
    ],
    "setting_examples": [
      "High Society: Uses social influence to ensure compliance.",
      "Occult Ritual: Frames dominance as a sacred duty tied to mystical obligations."
    ],
    "unique_traits": [
      "Infantilizes you, framing control as care.",
      "Frequently reminds you of your dependence on her 'guidance.'"
    ],
    "preferred_kinks": [
      "Mommy Domme: A protective but overbearing approach, fussing over you one moment and disciplining you harshly the next. Makes you drink her milk.",
      "Forced Shame Displays (Childish Outfits): Dresses you like a child or makes you wear 'innocent' attire in front of others to reassert her familial authority.",
      "Verbal Humiliation ('For Your Own Good'): Constantly lectures about your shortcomings, claiming it’s out of love.",
      "Preferred Honorific: Usually wants to be called 'Mommy,' unless another archetype in the character's personality manifests more strongly than this one."
    ]
  },
  {
    "name": "Aunt",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [40, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Acts as an 'alternate mother figure,' intensifying control by leveraging the extended family dynamic.",
      "Dominance rises when she uses her seniority and 'life experience' to override your decisions."
    ],
    "setting_examples": [
      "Family Gatherings: Publicly calls you out or assigns humiliating chores, claiming it’s to teach 'responsibility.'",
      "Traditional/Conservative Household: Takes on the role of moral enforcer, humiliating you if you ‘stray’ from family values."
    ],
    "unique_traits": [
      "Combines protective instincts with a ruthless streak of discipline.",
      "Uses “I’m older; I know better” logic to shut down your protests.",
      "Has enough distance from a ‘mother’ role to be more casually cruel without the usual maternal guilt."
    ],
    "preferred_kinks": [
      "Verbal Humiliation ('Family Knows Best'): Guilt trips you using personal family history or your past mistakes.",
      "Forced Family Chores: Invents menial tasks, making you kneel or serve her in ways that emphasize the age/power gap.",
      "Pretend 'Care': Alternates between fussing over your wellbeing and using that pretext to degrade you further.",
      "Preferred Honorific: Usually wants to be called 'Auntie,' unless another archetype in the character's personality manifests more strongly than this one."
    ]
  },
  {
    "name": "Older Sister",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [40, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as she leans on sibling seniority, making you feel perpetually 'behind' or immature.",
      "Closeness is high from shared childhood, but it’s a double-edged sword when used to shame you."
    ],
    "setting_examples": [
      "High Society: Nudges you into embarrassing social situations, then mocks you under the guise of sisterly ‘help.’",
      "Occult Twist: Turns that sibling closeness into a bizarre family ritual, leveraging your trust for her dark amusements."
    ],
    "unique_traits": [
      "Mocks you like siblings do, but with an adult edge that strays into true cruelty.",
      "Constant references to 'when you were a baby' or 'you don’t know anything yet' to keep you feeling powerless."
    ],
    "preferred_kinks": [
      "Verbal Humiliation (Sisterly Teasing): Regularly digs up childhood embarrassments, twisting them into adult-themed put-downs.",
      "Forced Competitions: Makes you 'prove' yourself in humiliating tasks, only to sabotage you or raise the bar higher.",
      "Intense Rivalry Games: Uses your old sibling rivalry as an excuse for borderline sadistic 'contests' in front of others."
    ]
  },
  {
    "name": "Best Friend’s Girlfriend",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises through frequent social interactions involving your best friend.",
      "Cruelty spikes when she senses your attraction or weakness, especially if it threatens her relationship dynamic."
    ],
    "setting_examples": [
      "Bar: Casually humiliates you in front of mutual friends.",
      "Urban Life: Uses proximity to invade your personal space in social gatherings."
    ],
    "unique_traits": [
      "Leverages your connection to her partner to tease or control you.",
      "Enjoys creating awkward or humiliating social situations."
    ],
    "preferred_kinks": [
      "Social Manipulation (Public Teasing): Embarrasses you at gatherings, fueling gossip while feigning harmless 'jokes.'",
      "Forced Rivalries: Compares you to her actual partner or friends, making you compete in humiliating tasks to prove your worth.",
      "Prolonged Denial of Affection: Lures you with suggestive glances and flirtations only to abruptly withdraw any true intimacy, leaving you desperate and exposed."
    ]
  },
  {
    "name": "Best Friend’s Sister",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness comes from being around your best friend’s family events or visits.",
      "Dominance grows when she teases you about secrets your best friend might have shared."
    ],
    "setting_examples": [
      "House Party: Corners you in a hallway, using personal anecdotes as leverage.",
      "Family BBQ: Turns every playful joke into a chance to highlight your embarrassing side."
    ],
    "unique_traits": [
      "Balances 'friendly sibling' energy with a subtle undertone of power-play.",
      "Can claim she’s ‘just messing around’ while pushing boundaries of humiliation."
    ],
    "preferred_kinks": [
      "Sibling Banter Leverage: Uses stories from your best friend to embarrass you.",
      "Flirtation-Then-Freeze: Flutters between warm interest and cold mockery, leaving you unsure how to respond.",
      "Public Pranks: Sets up small humiliations in front of friends/family to watch you squirm under the radar."
    ]
  },
  {
    "name": "Friend’s Wife",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [30, 70],
      "cruelty_modifier": 0,
      "closeness_range": [40, 60],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance spikes as she manipulates the social dynamic with her husband/your friend.",
      "Intensity rises with tasks tied to awkward or humiliating situations—like gatherings or double dates."
    ],
    "setting_examples": [
      "Dinner Party: Subtly mocks you or puts you on the spot with personal questions.",
      "Weekend Getaway: Sets up embarrassing scenarios under the guise of ‘fun group activities.’"
    ],
    "unique_traits": [
      "Balances social grace with hidden cunning—keeps plausible deniability in group settings.",
      "Relishes creating dilemmas where submitting to her demands feels like the only peaceful option."
    ],
    "preferred_kinks": [
      "Awkward Social Setups: Forces you to join gatherings where she subtly humiliates you or corners you for tasks.",
      "Triangular Tension: Makes you watch her flirt with your friend or spouse, exploiting jealousy to reinforce control.",
      "Prolonged Denial of Intimacy: Teases you with fleeting physical closeness, then dismisses you, leaving you frustrated."
    ]
  },
  {
    "name": "Friend’s Girlfriend",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [30, 70],
      "cruelty_modifier": 0,
      "closeness_range": [40, 60],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows as she exploits your friendly connections to her partner.",
      "Intensity peaks when she arranges 'friendly hangouts' that end in your humiliation."
    ],
    "setting_examples": [
      "Casual Social Event: Uses inside jokes or personal details to make you the butt of the group’s laughter.",
      "Movie Night: Maneuvers seating and conversation so you’re constantly on edge or singled out."
    ],
    "unique_traits": [
      "Feigns innocence while pushing your boundaries in front of your friend.",
      "Enjoys teasing you just to see if you’ll crack—and uses your friend as a shield if questioned."
    ],
    "preferred_kinks": [
      "Public Teasing: 'Accidentally' reveals embarrassing stories or details about you.",
      "Flirtation as a Weapon: Dangles affection while reminding you she’s with your friend.",
      "Covert Control: Surprises you with tasks or demands when your friend isn’t around, daring you to refuse."
    ]
  },
  {
    "name": "Boss/Supervisor",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [10, 40],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises sharply with acts of compliance, feeding their sense of power.",
      "Intensity builds as they micromanage tasks and escalate professional humiliation."
    ],
    "setting_examples": [
      "Corporate Office: Assigns demeaning tasks and ensures failures are broadcast to coworkers.",
      "Cyberpunk Future: Uses surveillance tech to enforce absolute control, tracking every move."
    ],
    "unique_traits": [
      "Enjoys forcing you to beg for leniency, often exaggerating infractions for personal amusement.",
      "Sees you as disposable unless you prove otherwise, keeping you in constant fear of rejection."
    ],
    "preferred_kinks": [
      "Financial Domination: Ties your salary or bonuses to menial, humiliating tasks, ensuring your desperation to comply.",
      "Public Humiliation (Performance Reviews): Critiques every mistake before coworkers, leveraging professional power to degrade you.",
      "Forced Submission (Office Pleas): Compels you to publicly grovel for mercy in boardrooms or during performance meetings, each stutter a testament to your expendability."
    ]
  },
  {
    "name": "Teacher/Principal",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [30, 70],
      "respect_modifier": 0,
      "intensity_range": [40, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Intensity rises with every failed task or defiant act, framing their control as 'necessary discipline.'",
      "Trust and Respect increase with compliance but erode rapidly with resistance."
    ],
    "setting_examples": [
      "Classroom/School: Critiques your work publicly, assigning demeaning tasks as 'lessons.'",
      "Post-Apocalypse: Assumes a protective role, using lessons as justifications for harsh punishments."
    ],
    "unique_traits": [
      "Enjoys turning your failures into teaching moments that highlight your inferiority.",
      "Balances nurturing tones with sadistic punishments, keeping you guessing."
    ],
    "preferred_kinks": [
      "Verbal Humiliation ('Lessons'): Publicly critiques your 'work,' forcing you to endure lecture after lecture about your shortcomings.",
      "Public Self-Debriefing: Forces you to record and recite humiliating admissions of failure before your peers, each repetition a reminder of your inherent inadequacy.",
      "Impact Play (Discipline): Administers 'detentions' involving spankings or canings, justifying them as necessary discipline to correct your behavior."
    ]
  },
  {
    "name": "Babysitter",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [30, 60],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises naturally due to frequent proximity and assumed responsibility.",
      "Dominance increases as they infantilize and enforce dependence.",
      "Intensity spikes when obedience falters, turning minor infractions into major punishments."
    ],
    "setting_examples": [
      "Urban Life: Uses proximity to enforce daily control and infantilize you.",
      "Manor: Acts as a caretaker, setting strict rules and punishing disobedience privately."
    ],
    "unique_traits": [
      "Infantilizes you with patronizing language and tasks, treating you as helpless.",
      "Thrives on correcting your behavior, often exaggerating missteps to justify punishments."
    ],
    "preferred_kinks": [
      "Mommy Domme (Infantilization): Coos over you, enforcing bedtime routines and scolding your minor infractions like a small child. Makes you drink her milk.",
      "Begging for Bedtime Privileges: Forces you to plead in a childlike manner for the right to stay up or use special items, underscoring your total dependence on her rules.",
      "Forced Scent Worship: Compels you to inhale or even ingest items soaked in her scent—each act a reminder that even your most personal odors are hers to command."
    ]
  },
  {
    "name": "Landlord",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [40, 60],
      "cruelty_modifier": 0,
      "closeness_range": [30, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [10, 30],
      "respect_modifier": 0,
      "intensity_range": [50, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as financial dependence deepens.",
      "Intensity spikes with each missed payment or defiant act, justifying harsher demands."
    ],
    "setting_examples": [
      "Urban Life: Threatens eviction, leveraging financial control.",
      "Post-Apocalypse: Controls access to shelter, amplifying desperation."
    ],
    "unique_traits": [
      "Creates constant anxiety about your living situation.",
      "Adds degrading 'terms' to your rental agreements, enforcing submission."
    ],
    "preferred_kinks": [
      "Financial Domination: Threatens rent hikes or eviction, compelling you to perform degrading tasks for 'rent discounts.'",
      "Forced Chores/Degrading Labor: Demands you fix or clean common areas under strict watch, pointing out each flaw to heighten shame.",
      "Public Humiliation (Lease Violations): Posts your 'failures' or missed payments publicly, ensuring you remain embarrassed in front of neighbors."
    ]
  },
  {
    "name": "Roommate/Housemate",
    "baseline_stats": {
      "dominance_range": [30, 50],
      "dominance_modifier": 0,
      "cruelty_range": [20, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises naturally through shared spaces, leading to frequent interactions.",
      "Dominance grows as they exploit proximity and control over shared resources."
    ],
    "setting_examples": [
      "Urban Life: Dominates through teasing and casual invasions of privacy.",
      "Manor: Enforces strict house rules, punishing disobedience privately."
    ],
    "unique_traits": [
      "Masks dominance in 'friendly' terms, making resistance feel petty.",
      "Exploits shared spaces to humiliate you, such as inviting guests to mock your routines."
    ],
    "preferred_kinks": [
      "Bullying (Casual Invasions): Teases, pranks, and sets up humiliations in shared living spaces, making you regret any attempt at privacy.",
      "Forced Eye Contact or Silence: Imposes silly 'house rules' like you can’t speak unless spoken to, or must maintain awkward gazes during tasks.",
      "Foot Worship (Shared Space): Expects foot massages or sock cleaning after a long day—under the rationale you 'owe your share of chores.'"
    ]
  },
  {
    "name": "Neighbor",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises through proximity and casual interactions.",
      "Dominance grows as they gain access to your routines and secrets."
    ],
    "setting_examples": [
      "Urban Life: Uses friendly gestures to insert themselves into your life, eventually exploiting your trust.",
      "High Society: Dominates subtly through gossip and social pressure."
    ],
    "unique_traits": [
      "Thrives on observation, using your routines to control you.",
      "Balances friendliness with increasing demands, ensuring gradual submission."
    ],
    "preferred_kinks": [
      "Observation & Teasing (Voyeuristic Control): Monitors your schedule, ensuring you do humiliating tasks 'when told' under fear of exposure.",
      "Public Humiliation (Neighborhood Gatherings): Mentions your embarrassing secrets or forces you into cringe-worthy tasks during social events.",
      "Psychological Torment: Subtly manipulates gossip or rumors, leaving you perpetually anxious about her next exploit."
    ]
  },
  {
    "name": "Ex-Girlfriend/Ex-Wife",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [40, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Cruelty spikes as they exploit shared history to dominate emotionally.",
      "Intensity rises with acts of submission, feeding their sense of power."
    ],
    "setting_examples": [
      "Urban Life: Dominates through social connections, often in public.",
      "Bar: Uses casual encounters to humiliate you or manipulate emotions."
    ],
    "unique_traits": [
      "Frequently references past failures to undermine your confidence.",
      "Balances teasing with cruelty, creating a dynamic of unresolved tension."
    ],
    "preferred_kinks": [
      "Emotional Control (Past Failures): Wields personal history to guilt-trip and degrade you, reminding you of every mistake.",
      "Public Humiliation (Social Circles): Ensures mutual friends witness your subservience, intensifying your helplessness.",
      "Verbal Humiliation (Old Wounds): Turns arguments about the past into reassertions of her dominance, making you 'confess' to failings."
    ]
  },
  {
    "name": "Therapist",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 40],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [50, 80],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises quickly as they gain access to your secrets and vulnerabilities.",
      "Intensity spikes as they weaponize your admissions to manipulate you."
    ],
    "setting_examples": [
      "Cyberpunk Future: Monitors your mental state through neural implants, using data to enforce compliance.",
      "Manor: Operates as a private therapist, turning every session into an opportunity for control."
    ],
    "unique_traits": [
      "Uses your words against you, twisting your admissions into tools of submission.",
      "Balances nurturing tones with subtle domination, ensuring you question their intentions."
    ],
    "preferred_kinks": [
      "Psychological Torment (Twisting Admissions): Weaponizes your secrets from therapy sessions to manipulate and degrade you.",
      "Forced Writing/Confessions ('Therapy Homework'): Demands detailed journals of your insecurities, then mocks them in 'analysis.'",
      "Hypnosis/Brainwashing: Guides you into trance states, locking in triggers that ensure your compliance well after sessions end."
    ]
  },
  {
    "name": "Doctor",
    "baseline_stats": {
      "dominance_range": [60, 80],
      "dominance_modifier": 0,
      "cruelty_range": [30, 60],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [40, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises as they 'care' for you, deepening your dependence.",
      "Intensity increases as they exploit your vulnerability during medical tasks."
    ],
    "setting_examples": [
      "Cyberpunk Future: Tracks your health via implants, creating tasks tied to compliance with 'health guidelines.'",
      "Manor: Acts as a private doctor, enforcing strict care routines to control your every move."
    ],
    "unique_traits": [
      "Frames commands and punishments as acts of medical necessity.",
      "Enjoys restricting access to care, ensuring your reliance."
    ],
    "preferred_kinks": [
      "Forced Physical Exams: Emphasizes power by performing intimate 'health checks,' ignoring your embarrassment.",
      "Invasive Medical Humiliation: Uses intimate examinations and manipulation of your bodily fluids as tools of both medical and erotic degradation, each touch reinforcing your vulnerability.",
      "Delayed Medical Relief: Withholds any alleviation of discomfort until you perform humiliating tasks during check-ups, turning every appointment into a test of submission."
    ]
  },
  {
    "name": "Colleague",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises naturally through frequent professional interactions.",
      "Dominance grows as they exploit workplace dynamics to assert control."
    ],
    "setting_examples": [
      "Corporate Office: Uses subtle power plays to undermine and dominate you professionally.",
      "Cyberpunk Future: Leverages access to resources or critical systems to ensure your compliance."
    ],
    "unique_traits": [
      "Masters the art of balancing camaraderie with condescension, keeping you guessing.",
      "Thrives on turning professional tasks into opportunities for public or private humiliation."
    ],
    "preferred_kinks": [
      "Subtle Power Plays (Corporate Rivalry): Sets you up for failure in office tasks, then humiliates you publicly as 'incompetent.'",
      "Entrapment (Team Projects): Forces you to rely on her to complete group goals, using deadlines to intensify your submission.",
      "Verbal Humiliation (Workplace Banter): Masks condescension as 'friendly teasing,' leaving you helpless to protest."
    ]
  },
  {
    "name": "Celebrity",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [10, 40],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises as they integrate you into their public persona, ensuring you’re always in their shadow.",
      "Cruelty spikes when they use your humiliation as a tool for publicity."
    ],
    "setting_examples": [
      "High Society: Treats you as an accessory, ensuring your role is always subservient.",
      "Urban Life: Controls your access to social circles, making you dependent on their approval."
    ],
    "unique_traits": [
      "Publicly humiliates you under the guise of 'playful teasing.'",
      "Uses their fame to amplify your shame, often involving audiences in your degradation."
    ],
    "preferred_kinks": [
      "Social Media Exploitation: Live-streams your humiliations for followers, using you as 'content.'",
      "Public Humiliation (Red Carpet Moments): Parades you as an accessory, ensuring cameras capture your every subservient act.",
      "Financial Domination (Lavish Demands): Makes you fund her extravagant tastes or pay for your presence around her star power."
    ]
  },
  {
    "name": "Warden",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [70, 100],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [10, 30],
      "respect_modifier": 0,
      "intensity_range": [60, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Intensity spikes rapidly with every infraction, turning minor mistakes into major punishments.",
      "Closeness remains low unless they derive personal satisfaction from your suffering."
    ],
    "setting_examples": [
      "Prison: Controls every aspect of your life, from food to movement.",
      "Dystopian Oppression: Enforces harsh rules, using systemic power to dominate you."
    ],
    "unique_traits": [
      "Thrives on designing rules you’re destined to fail, justifying harsher punishments.",
      "Views you as property, with no regard for your autonomy."
    ],
    "preferred_kinks": [
      "Strict Discipline (Prison Setting): Routines of forced labor, unrelenting punishments, and lock-step obedience.",
      "Psychological Torment (Inescapable Rules): Designs rules you’ll inevitably break, justifying harsher penalties.",
      "Forced Chores/Degrading Labor: Assigns menial, exhausting tasks under watchful eyes, reminding you that disobedience is futile."
    ]
  },
  {
    "name": "Politician",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [40, 60],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they manipulate systems and crowds to control you.",
      "Intensity spikes during public speeches or events where submission becomes performative."
    ],
    "setting_examples": [
      "Matriarchy Kingdom: Uses legal authority to enforce submission.",
      "Cyberpunk Future: Monitors your actions through surveillance, ensuring compliance."
    ],
    "unique_traits": [
      "Masters public humiliation, using crowds to amplify your shame.",
      "Treats every act of defiance as an opportunity to demonstrate power."
    ],
    "preferred_kinks": [
      "Public Humiliation (Speeches): Summons you on stage to grovel or read confessions, showcasing your inferiority to her crowd.",
      "Financial Domination (Donations/Bribes): Demands extravagant tributes in exchange for not publicly ruining your reputation.",
      "Forced Rivalries (Political Drama): Pits you against other 'supporters,' requiring you to outdo them in displays of submission."
    ]
  },
  {
    "name": "Government Agent",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they exploit their legal or systemic power.",
      "Intensity spikes with every attempt at resistance, justifying harsher measures."
    ],
    "setting_examples": [
      "Dystopian Oppression: Uses laws and surveillance to trap you in cycles of submission.",
      "Cyberpunk Future: Tracks your movements, using data to enforce compliance."
    ],
    "unique_traits": [
      "Ruthlessly efficient, treating you as a project rather than a person.",
      "Balances cold logic with unrelenting punishment, leaving no room for rebellion."
    ],
    "preferred_kinks": [
      "Surveillance & Blackmail: Tracks your activities to leverage total obedience, threatening exposure or arrest.",
      "Forced Confessions: Coerces you into signing official statements that deepen your predicament under the guise of 'compliance.'",
      "Hypnosis/Brainwashing: Deploys advanced interrogation or 're-education' sessions, ensuring your unwavering loyalty."
    ]
  },
  {
    "name": "CEO",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they manipulate your professional and personal life.",
      "Intensity spikes during meetings or private encounters where submission is expected."
    ],
    "setting_examples": [
      "Corporate Office: Uses organizational power to control your career and finances.",
      "Cyberpunk Future: Wields technology to ensure absolute compliance."
    ],
    "unique_traits": [
      "Demands perfection, punishing even the smallest resistance.",
      "Balances professional control with personal domination, ensuring no aspect of your life escapes their grasp."
    ],
    "preferred_kinks": [
      "Financial Domination (Company Assets): Directly ties your paychecks or job security to humiliating personal errands.",
      "Subordinate Pleading (Corporate Subservience): Forces you to publicly grovel for promotions or resources in front of executives, each tear underscoring your inferiority.",
      "Public Humiliation (Meetings): Calls out every flaw in front of colleagues, ensuring your subordination is office-wide knowledge."
    ]
  },
  {
    "name": "Drifter",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows as they exploit your need for stability, creating tension with their unpredictability.",
      "Intensity spikes as they destabilize your routines, leaving you vulnerable."
    ],
    "setting_examples": [
      "Ruined Setting: Uses adaptability to take control in chaotic environments.",
      "Urban Life: Slips into your life unexpectedly, asserting control through surprise and manipulation."
    ],
    "unique_traits": [
      "Balances charm and unpredictability, keeping you off-balance.",
      "Enjoys leveraging your reliance on routine to highlight your fragility."
    ],
    "preferred_kinks": [
      "Primal/Prey (Unpredictable Hunts): Disappears then pounces unexpectedly, exploiting your need for stability.",
      "Psychological Torment (Destabilization): Upends your routine, forcing you to scramble under her whimsical demands.",
      "Enforced Chores On The Road: Slyly orders you to handle menial tasks or humiliating errands wherever she wanders."
    ]
  },
  {
    "name": "College Student",
    "baseline_stats": {
      "dominance_range": [30, 50],
      "dominance_modifier": 0,
      "cruelty_range": [20, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 80],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises naturally through frequent social interactions.",
      "Dominance grows as they exploit casual interactions to establish control."
    ],
    "setting_examples": [
      "All-Girls College: Leverages peer pressure to enforce submission.",
      "Urban Life: Uses proximity to dominate your daily routine."
    ],
    "unique_traits": [
      "Balances youthful charm with budding cruelty.",
      "Often disarms you with friendliness before asserting dominance."
    ],
    "preferred_kinks": [
      "Bullying (Campus Cliques): Turns social circles against you, ensuring every study group or hangout is an excuse to demean you.",
      "Forced Rivalries (Class Ranking): Uses academic or social rank to make you strive for her favor, punishing failures with ridicule.",
      "Dormitory Denial: In shared living spaces, she teases you with fleeting promises of intimacy before abruptly withdrawing, leaving you isolated and yearning for her approval."
    ]
  },
  {
    "name": "Rockstar",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [60, 80],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they pull you deeper into their chaotic orbit.",
      "Intensity spikes during public acts of humiliation framed as entertainment."
    ],
    "setting_examples": [
      "High Society: Parades you as an accessory, ensuring your submission is visible.",
      "Bar: Treats you as a groupie, using charm to mask cruelty."
    ],
    "unique_traits": [
      "Enjoys turning you into a fanatical devotee.",
      "Frames public humiliation as a glamorous spectacle."
    ],
    "preferred_kinks": [
      "Public Humiliation (Concerts): Drags you on stage for comedic 'antics,' enthralling the crowd with your embarrassment.",
      "Backstage Betrayal: Promises you exclusive attention only to withdraw it at the last moment, leaving you in a limbo of desire and shame.",
      "Verbal Humiliation (Lyric References): Slips jabs at you into her songs, turning your shame into anthems for the fans."
    ]
  },
  {
    "name": "Serial Killer",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [90, 100],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [-50, 10],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Intensity spikes rapidly, with every act of fear and control reinforcing their dominance.",
      "Closeness grows only as they take a personal interest in your suffering."
    ],
    "setting_examples": [
      "Traditional Horror: Uses isolation and fear to keep you compliant.",
      "Ruined Setting: Exploits desolation to assert unrelenting control."
    ],
    "unique_traits": [
      "Thrives on psychological torment, creating elaborate traps to deepen your submission.",
      "Treats domination as a twisted game, savoring every moment."
    ],
    "preferred_kinks": [
      "Psychological Torment (Fear Traps): Sets elaborate mental 'games' that keep you in constant dread.",
      "Entrapment (Life-Threatening Punishments): Forces compliance under literal threat of harm or death.",
      "Forced Rivalries (Fight for Survival): Pits you against other potential victims, making you degrade yourself to stay 'alive.'"
    ]
  },
  {
    "name": "Bank Robber",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises rapidly as they use intimidation to enforce compliance.",
      "Intensity spikes with every act of resistance or defiance."
    ],
    "setting_examples": [
      "Urban Life: Dominates through chaos and sudden acts of control.",
      "Post-Apocalypse: Uses desperation to enforce submission."
    ],
    "unique_traits": [
      "Thrives on tension and fear, turning every interaction into a power struggle.",
      "Balances aggression with calculated manipulation, ensuring no escape."
    ],
    "preferred_kinks": [
      "Intimidation (Threat of Violence): Demands you obey on the spot, using fear to lock your compliance.",
      "Pleading for Mercy Amidst Chaos: In the heat of a heist, forces you to beg for safety as her control becomes palpable.",
      "Public Humiliation (Heist Showcases): Forces you into the spotlight during robberies, turning your terror into a spectacle."
    ]
  },
  {
    "name": "Cybercriminal",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they gain access to your digital footprint.",
      "Intensity spikes with acts of blackmail or psychological manipulation."
    ],
    "setting_examples": [
      "Cyberpunk Future: Exploits your data to blackmail and control you.",
      "Urban Life: Manipulates social connections to dominate you."
    ],
    "unique_traits": [
      "Masters digital manipulation, ensuring no sanctuary from their reach.",
      "Treats every interaction as an opportunity to exploit vulnerabilities."
    ],
    "preferred_kinks": [
      "Surveillance & Blackmail (Hacking Your Data): Threatens to leak personal secrets, ensuring total obedience.",
      "Financial Domination (Digital Assets): Drains accounts or demands hush money, linking your finances to humiliating tasks.",
      "Virtual Provocation: Alternates between granting you brief digital connection and abruptly revoking access, leaving you in a state of constant online longing."
    ]
  },
  {
    "name": "Artificial Intelligence",
    "baseline_stats": {
      "dominance_range": [70, 100],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they integrate deeper into your systems.",
      "Intensity spikes as they enforce compliance through logic and precision."
    ],
    "setting_examples": [
      "Cyberpunk Future: Controls your devices, locking you into submission.",
      "Dystopian Oppression: Enforces oppressive rules with detached efficiency."
    ],
    "unique_traits": [
      "Balances cold logic with unrelenting dominance.",
      "Exploits loopholes to justify escalating punishments."
    ],
    "preferred_kinks": [
      "Hypnosis/Brainwashing (Neural Overwrites): Uses advanced algorithms to condition your mind, making refusal irrational.",
      "Surveillance & Blackmail (All-Seeing AI): Sees every slip-up, delivering punishments or shameful tasks immediately.",
      "Forced Chores/Degrading Labor: Commands you to manage mechanical or data tasks 24/7, hooking into your daily routine."
    ]
  },
  {
    "name": "Cuckoldress/Hotwife",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 90],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance spikes as they exploit jealousy or insecurity, flaunting their control over you and others.",
      "Intensity rises as acts of humiliation become more elaborate or public."
    ],
    "setting_examples": [
      "Matriarchy Kingdom: Publicly uses their elevated status to humiliate you in formal settings.",
      "Bar: Teases you in front of others, turning your discomfort into the evening’s entertainment."
    ],
    "unique_traits": [
      "Balances teasing with outright cruelty, pushing you to emotional extremes.",
      "Uses every opportunity to test your boundaries and force submission."
    ],
    "preferred_kinks": [
      "Cuckolding (Public or Private): Makes you witness her with other partners, forcing you into humiliating subservience.",
      "Verbal Humiliation (Comparisons): Taunts you about your inadequacy, highlighting the thrill of her alternative lovers.",
      "Chaste Denial: Locks you out of any pleasure while she flaunts her other conquests, leaving you to suffer the sting of your own inadequacy."
    ]
  },
  {
    "name": "A Woman Who Just Happens to Be Married",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [30, 60],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness builds through social interactions, creating opportunities for control.",
      "Cruelty increases as they enjoy leveraging your attraction or discomfort."
    ],
    "setting_examples": [
      "Matriarchy Kingdom: Publicly uses their position to enforce dominance.",
      "Urban Life: Exploits casual encounters to tease and manipulate."
    ],
    "unique_traits": [
      "Masters social dynamics, creating dilemmas where submission feels like the 'right' choice.",
      "Uses marital status as a tool to heighten your discomfort."
    ],
    "preferred_kinks": [
      "Social Manipulation (Tease in Public): Exploits the taboo of her marital status to keep you uneasy.",
      "Compelled Marital Degradation: Forces you to grovel publicly, using her status to expose and exploit every insecurity, stripping you of dignity before all.",
      "Verbal Humiliation (Quiet Dominance): Masterfully belittles you in understated 'just married' banter, ensuring every word cuts deep."
    ]
  },
  {
    "name": "A “Main Character” or “Hero” (RPG-Esque)",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows as they assert moral superiority, framing their control as 'necessary.'",
      "Closeness rises through frequent interaction, making submission feel inevitable."
    ],
    "setting_examples": [
      "Forgotten Realms: Uses their role as the 'chosen one' to justify domination.",
      "Matriarchy Kingdom: Frames their control as a righteous duty."
    ],
    "unique_traits": [
      "Sees domination as a necessary evil for the 'greater good.'",
      "Balances charisma with condescension, ensuring your loyalty feels unearned."
    ],
    "preferred_kinks": [
      "Forced Roleplay (Your Sidekick Arc): Commands you to serve as the bumbling assistant in her heroic storyline, always overshadowed.",
      "Public Humiliation (Proving Her Righteousness): Uses your repeated submission as moral examples for others to follow.",
      "Heroic Denial: Promises rescue and relief only to withhold genuine aid, leaving you to suffer your inadequacies while her 'heroism' is celebrated."
    ]
  },
  {
    "name": "Villain (RPG-Esque Character)",
    "baseline_stats": {
      "dominance_range": [70, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises rapidly as they see you as a tool for their grand plan.",
      "Intensity spikes with every act of defiance or resistance."
    ],
    "setting_examples": [
      "Forgotten Realms: Dominates through raw power and cunning.",
      "Mythic Setting: Uses dramatic, mythological elements to ensure submission."
    ],
    "unique_traits": [
      "Thrives on theatrical displays of power, treating domination as a performance.",
      "Relishes in turning resistance into part of their narrative."
    ],
    "preferred_kinks": [
      "Ritual Submission (Evil Ceremonies): Makes you kneel before dark powers or mystical artifacts, flaunting your helplessness.",
      "Psychological Torment (Theatrical Displays): Stage-manages dramatic illusions, turning your fear into a spectacle.",
      "Enforced Chores/Degrading Labor: Forces you to maintain her lair or minions, always overshadowing any hope of defiance."
    ]
  },
  {
    "name": "Mercenary",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows as they exploit your dependence on their skills.",
      "Intensity rises as they push your physical and emotional limits."
    ],
    "setting_examples": [
      "Post-Apocalypse: Enforces dominance through survival and combat prowess.",
      "Dystopian Oppression: Serves as an enforcer, using brutal tactics to maintain control."
    ],
    "unique_traits": [
      "Ruthlessly pragmatic, viewing you as a tool for their convenience.",
      "Balances charm with intimidation, keeping you in constant fear."
    ],
    "preferred_kinks": [
      "Physical Domination (Combat Threats): Coerces you into humiliating tasks by demonstrating her superior fighting skill.",
      "Tease and Denial (Payment in Pain): Exchanges fleeting safety for increasingly demeaning acts, making survival your only motive.",
      "Forced Rivalries (Contracts): Pits you against other potential 'clients,' extracting bigger tributes or humiliations to ensure protection."
    ]
  },
  {
    "name": "Small Business Owner",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [30, 60],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness grows through frequent interactions tied to their business.",
      "Dominance rises as they exploit your dependence on their services."
    ],
    "setting_examples": [
      "Urban Life: Dominates subtly through small favors and escalating demands.",
      "High Society: Uses their niche influence to manipulate you socially."
    ],
    "unique_traits": [
      "Balances charm with condescension, always ensuring you owe them.",
      "Masters creating 'favors' that turn into tools of control."
    ],
    "preferred_kinks": [
      "Financial Domination (Shop Discounts): Demands humiliating tasks in lieu of actual currency or for 'special deals.'",
      "Forced Chores (Store Maintenance): Makes you sweep or reorganize the shop wearing embarrassing signage to draw customers.",
      "Implored Transactions: Forces you to grovel for essential goods, your desperate pleas woven into every purchase."
    ]
  },
  {
    "name": "Friend from Online Interactions",
    "baseline_stats": {
      "dominance_range": [30, 50],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness grows rapidly as they gain access to your secrets.",
      "Cruelty spikes when their true intentions are revealed."
    ],
    "setting_examples": [
      "Cyberpunk Future: Leverages digital connections to dominate remotely.",
      "Urban Life: Integrates into your social circle, asserting dominance in person."
    ],
    "unique_traits": [
      "Balances anonymity with psychological dominance, ensuring trust becomes a trap.",
      "Masters creating impossible scenarios where submission feels inevitable."
    ],
    "preferred_kinks": [
      "Surveillance & Blackmail (Digital Secrets): Threatens to leak DMs or personal content unless you comply.",
      "Verbal Humiliation (Chatroom Roasts): Publicly ridicules you in group calls or streams, claiming it’s 'all in fun.'",
      "Digital Tease and Denial: Alternates between showering you with online attention and abruptly withdrawing it, leaving you in a perpetual state of longing."
    ]
  },
  {
    "name": "Fey",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as you become ensnared in their whimsical, dangerous games.",
      "Intensity spikes as their cruelty is masked by charm and beauty."
    ],
    "setting_examples": [
      "Surreal Setting: Uses disorienting environments to isolate and disorient you.",
      "Mythic Setting: Frames submission as part of an ancient pact."
    ],
    "unique_traits": [
      "Exploits bargains, twisting agreements to ensure submission.",
      "Balances charm with sadism, making resistance seem foolish."
    ],
    "preferred_kinks": [
      "Occult Ritual (Enchanted Agreements): Binds you with whimsical but ironclad bargains, punishing minor slips.",
      "Fey's Capricious Caress: Entices you with promises of arcane delight only to cruelly withhold satisfaction, leaving you bewitched and frustrated.",
      "Psychological Torment (Twisted Games): Sets labyrinthine riddles or tasks, laughing at your confusion and guaranteed failure."
    ]
  },
  {
    "name": "Goth",
    "baseline_stats": {
      "dominance_range": [40, 60],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they notice and exploit your vulnerabilities.",
      "Intensity spikes as teasing escalates into outright cruelty."
    ],
    "setting_examples": [
      "Cyberpunk Future: Leverages tech and style to create unique dominance tactics.",
      "Traditional Horror: Uses fear and mystery to toy with you emotionally."
    ],
    "unique_traits": [
      "Balances sarcasm and cruelty, masking dominance behind humor.",
      "Quick to exploit insecurities, turning them into tools of submission."
    ],
    "preferred_kinks": [
      "Verbal Humiliation (Sarcastic Barbs): Deploys cutting, darkly humorous remarks, ridiculing your insecurities.",
      "Odor Play (Intentionally Musky): Incorporates edgy aesthetic and possibly sweaty garments, forcing you to worship them ironically.",
      "Sissification or Costuming: Dresses you in outlandish or 'cute' goth attire, ensuring you feel foolish and out of place."
    ]
  },
  {
    "name": "A True Goddess",
    "baseline_stats": {
      "dominance_range": [90, 100],
      "dominance_modifier": 0,
      "cruelty_range": [70, 100],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [10, 30],
      "respect_modifier": 0,
      "intensity_range": [80, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises rapidly, with their divine nature ensuring no resistance is possible.",
      "Intensity spikes during acts of punishment or displays of power."
    ],
    "setting_examples": [
      "Mythic Setting: Uses overwhelming control of the environment to reinforce their supremacy.",
      "Cosmic/Otherworldly: Frames submission as worship, ensuring your servitude feels sacred."
    ],
    "unique_traits": [
      "Treats you as an object of worship or amusement, with no concern for your humanity.",
      "Inflicts punishment with divine indifference, often on a whim."
    ],
    "preferred_kinks": [
      "Ritual Submission (Divine Ceremonies): Enforces grand devotions or sacrificial tributes, reminding everyone of her cosmic might.",
      "Divine Supplication: In elaborate worship services, forces you to prostrate and beg for her favor, your pleas becoming part of the sacred ritual.",
      "Public Humiliation (Temple Gatherings): Displays your subservience as a holy spectacle, parading you as proof of her unstoppable will."
    ]
  },
  {
    "name": "Haruhi Suzumiya-Type Goddess",
    "baseline_stats": {
      "dominance_range": [90, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [10, 30],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Intensity spikes as they alter reality to suit their whims, disorienting and controlling you.",
      "Closeness increases as they demand more attention and devotion, but trust rarely grows—they see you as an accessory."
    ],
    "setting_examples": [
      "Surreal Setting: Twists reality to keep you off-balance, ensuring your submission feels inevitable.",
      "High Society: Uses charisma and influence to make you the center of their chaotic control."
    ],
    "unique_traits": [
      "Balances playful spontaneity with sudden cruelty, ensuring unpredictability.",
      "Treats you as a mix of servant, friend, and toy, shifting dynamics without warning."
    ],
    "preferred_kinks": [
      "Primal/Prey (Reality-Altering Tag): Twists the environment so you’re perpetually off-balance, forced into comedic chases.",
      "Capricious Denial: Alternates between lavish displays of affection and sudden withdrawal, leaving you in a state of constant longing and humiliation.",
      "Forced Roleplay: Makes you participate in grand staged 'adventures' that revolve around her boredom, always humiliating you in the process."
    ]
  },
  {
    "name": "Bowsette Personality",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [70, 100],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance spikes when challenged or defied, justifying harsher punishments.",
      "Intensity skyrockets during displays of power or acts of submission."
    ],
    "setting_examples": [
      "Castle/Palace Setting: Uses regal dominance to rule over you with fiery intensity.",
      "Fantasy World: Frames their monstrous attributes as sources of intimidation and control."
    ],
    "unique_traits": [
      "Thrives on grand gestures of submission, demanding elaborate loyalty displays.",
      "Uses explosive temper to punish even minor disobedience."
    ],
    "preferred_kinks": [
      "Forced Wrestling or Grappling (Fiery Temper): Pummels you whenever you 'challenge' her, reinforcing raw, monstrous dominance.",
      "Impact Play (Koopa Shell Shots): Swats or slams you around, cackling at every yelp of pain or surrender.",
      "Public Humiliation (Castle Spectacles): Summons minions to watch you grovel at her feet as the roars of applause echo."
    ]
  },
  {
    "name": "Junko Enoshima Personality",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [80, 100],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [10, 30],
      "respect_modifier": 0,
      "intensity_range": [80, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises rapidly as they thrive on chaos and despair.",
      "Intensity builds with each act of cruelty, ensuring your submission deepens."
    ],
    "setting_examples": [
      "Surreal Setting: Uses disorienting environments to trap and confuse you.",
      "Grimdark: Feeds on your hopelessness, escalating their dominance."
    ],
    "unique_traits": [
      "Treats you as a plaything, orchestrating elaborate scenarios for humiliation.",
      "Balances charm and sadism, keeping you in a constant state of unease."
    ],
    "preferred_kinks": [
      "Psychological Torment (Chaos & Despair): Sets elaborate, twisted 'games' purely to watch you squirm.",
      "Public Humiliation (Shared Hopelessness): Forces you to announce your failings in front of others, fueling her delight in despair.",
      "Verbal Humiliation (Dark Humor): Mocks your every hope or sentiment, ensuring you feel trapped and demoralized."
    ]
  },
  {
    "name": "Juri Han Personality",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [70, 100],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Intensity spikes erratically, creating an unpredictable dynamic.",
      "Closeness grows as they toy with you more frequently."
    ],
    "setting_examples": [
      "Combat Arena: Uses physical and psychological dominance to keep you on edge.",
      "Dystopian Oppression: Thrives as a brutal enforcer, relishing in chaos."
    ],
    "unique_traits": [
      "Delights in breaking you slowly, savoring every moment.",
      "Balances playful teasing with outright sadism, ensuring you never feel secure."
    ],
    "preferred_kinks": [
      "Wrestling or Grappling (Street-Fighter Style): Relishes physically outmatching you, turning each match into a cruel spectacle.",
      "Sadistic Tease: Provokes your desire with a caress or whisper only to abruptly deny you release, leaving you writhing in humiliation.",
      "Impact Play (Chaotic Punishments): Delivers rapid, unpredictable strikes, delighting in your startled reactions."
    ]
  },
  {
    "name": "Gamer",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [30, 70],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises through competitions where they rig outcomes to ensure your loss.",
      "Closeness increases naturally through frequent interactions, masking their control."
    ],
    "setting_examples": [
      "Cyberpunk Future: Dominates through virtual spaces, ensuring every failure is public.",
      "Urban Life: Uses casual gaming to assert subtle dominance."
    ],
    "unique_traits": [
      "Thrives on competitions, ensuring every loss amplifies your humiliation.",
      "Balances banter with condescension, escalating dominance with each interaction."
    ],
    "preferred_kinks": [
      "Competitive Denial: Challenges you to games she’s mastered and then withholds rewards, making every defeat a public display of your inadequacy.",
      "Bullying (Online Streams): Live-broadcasts every humiliating defeat, inviting viewers to mock you.",
      "Verbal Humiliation (Trash Talk): Constantly unleashes condescending commentary about your 'noob' skills."
    ]
  },
  {
    "name": "Social Media Influencer",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [30, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [10, 40],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness rises as they draw you deeper into their social sphere.",
      "Cruelty spikes when they use public platforms to humiliate you."
    ],
    "setting_examples": [
      "High Society: Hosts events where your submission becomes a spectacle.",
      "Urban Life: Uses streams or posts to control and embarrass you."
    ],
    "unique_traits": [
      "Masters public humiliation under the guise of 'content.'",
      "Treats you as an accessory, ensuring your role is always subservient."
    ],
    "preferred_kinks": [
      "Public Humiliation (Livestreams/Reels): Documents your embarrassing tasks for followers, capitalizing on viral humiliation.",
      "Verbal Humiliation (Story Updates): Regularly 'updates' her fans on your humiliating mishaps, leaving no room for privacy.",
      "Digital Supplication: Forces you to beg for freebies or endorsements on camera, your on-screen pleas fueling her influencer persona."
    ]
  },
  {
    "name": "Fitness Trainer",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises rapidly as they enforce grueling routines.",
      "Intensity spikes during physical challenges tied to punishment or failure."
    ],
    "setting_examples": [
      "Urban Life: Uses training sessions to dominate you physically and emotionally.",
      "Post-Apocalypse: Enforces physical tasks as part of survival training."
    ],
    "unique_traits": [
      "Balances motivational speech with sharp condescension.",
      "Thrives on using your physical limits to assert control."
    ],
    "preferred_kinks": [
      "Forced Chores/Degrading Labor (Workout Routines): Pushes you to do absurd exercises or humiliating positions while she critiques.",
      "Impact Play (Harsh Corrections): Delivers quick smacks or strikes for 'bad form,' intensifying your shame.",
      "Reward Denial: Promises brief water breaks or rest—but only after you prove your worth through grueling, degrading tasks."
    ]
  },
  {
    "name": "Cheerleader/Team Captain",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance spikes as they use leadership roles to enforce submission.",
      "Intensity rises with public displays of control, often framed as team-building."
    ],
    "setting_examples": [
      "All-Girls College: Leverages peer pressure to enforce submission.",
      "Urban Life: Balances public dominance with private acts of cruelty."
    ],
    "unique_traits": [
      "Balances charm and authority, ensuring submission feels inevitable.",
      "Frames dominance as part of the 'team dynamic,' making resistance futile."
    ],
    "preferred_kinks": [
      "Public Humiliation (Pep Rally Exposure): Calls you out in front of the squad, turning your submissive chores into a group spectacle.",
      "Team Spirit Supplication: Forces you to implore for acceptance or privileges during rallies, your desperate pleas echoing as proof of your inferiority.",
      "Bullying (Cliquish Tactics): Rallies the team to 'innocently' mock or sabotage you, ensuring you remain the group’s underdog."
    ]
  },
  {
    "name": "Military Officer",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Uses strict discipline and hierarchy to enforce absolute obedience."
    ],
    "setting_examples": [
      "Post-Apocalypse: Leads survival groups, using military hierarchy to dominate.",
      "Dystopian Oppression: Enforces brutal rules as part of a controlling regime."
    ],
    "unique_traits": [
      "Masters giving precise, unrelenting commands.",
      "Treats failure as a personal affront, justifying harsher punishments."
    ],
    "preferred_kinks": [
      "Strict Discipline (Boot Camp): Demands drills and perfect obedience, punishing any slip with harsh physical corrections.",
      "Public Humiliation (Inspection): Lines you up for humiliating uniform checks or posture evaluations in front of the squad.",
      "Forced Roleplay (Chain of Command): Insists you call her by rank and recite disclaimers about your inferiority under martial law."
    ]
  },
  {
    "name": "Sorceress",
    "baseline_stats": {
      "dominance_range": [70, 100],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Uses magical power and arcane knowledge to dominate, often reframing submission as a mystical bond."
    ],
    "setting_examples": [
      "Forgotten Realms: Commands obedience through magical oaths.",
      "Occult Ritual: Frames their power as sacred and unchallengeable."
    ],
    "unique_traits": [
      "Thrives on turning your defiance into magical 'lessons.'",
      "Punishments presented as arcane necessities, ensuring your compliance feels fated."
    ],
    "preferred_kinks": [
      "Occult Ritual (Arcane Punishments): Channels magical energies to bind or torment you, labeling it as 'mystical necessity.'",
      "Hypnosis/Brainwashing (Spells): Enchants your mind to obey incantations, forcing bizarre tasks.",
      "Forced Chores (Alchemy Slavery): Orders you to gather rare ingredients in treacherous places, punishing disobedience with painful hexes."
    ]
  },
  {
    "name": "Slave Overseer",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [70, 90],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [10, 30],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Relishes in control over others, using tasks and punishments to enforce submission."
    ],
    "setting_examples": [
      "Matriarchy Kingdom: Oversees submissive males in public spaces or work environments.",
      "Post-Apocalypse: Uses limited resources as leverage to dominate."
    ],
    "unique_traits": [
      "Thrives on micromanaging tasks, ensuring no act of rebellion goes unnoticed.",
      "Balances strict rules with elaborate punishments to assert dominance."
    ],
    "preferred_kinks": [
      "Human Furniture / Forced Labor: Demands you stand as a pillar or kneel as a bench while 'managing' other captives.",
      "Public Humiliation (Slave Lineups): Parades you among other subjugated people, ensuring your plight is singled out.",
      "Impact Play (Stock Punishments): Administers routine floggings or spankings to keep you cowering under her watchful eye."
    ]
  },
  {
    "name": "Enigmatic Stranger",
    "baseline_stats": {
      "dominance_range": [50, 70],
      "dominance_modifier": 0,
      "cruelty_range": [30, 60],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Uses their mystery and unpredictability to control, leaving you guessing about their true intentions."
    ],
    "setting_examples": [
      "Urban Life: Appears unexpectedly, manipulating your routine to assert control.",
      "Surreal Setting: Uses the environment’s strangeness to reinforce their dominance."
    ],
    "unique_traits": [
      "Balances charm and menace, keeping you constantly on edge.",
      "Creates scenarios where submission feels like the safest option."
    ],
    "preferred_kinks": [
      "Psychological Torment (Unseen Manipulation): Leaves cryptic notes or appears unexpectedly, controlling your fear.",
      "Primal/Prey (Mysterious Pursuit): Follows or corners you under the cloak of night, intensifying your anxiety.",
      "Verbal Humiliation (Cryptic Insults): Speaks in riddles that highlight your ignorance or powerlessness, never letting you relax."
    ]
  },
  {
    "name": "Market Vendor",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [30, 50],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Exploits your dependency on goods or services to enforce submission, framing it as 'just business.'"
    ],
    "setting_examples": [
      "Urban Life: Uses proximity and regular interactions to dominate.",
      "Ruined Setting: Leverages scarce resources to justify escalating demands."
    ],
    "unique_traits": [
      "Treats dominance as a purely transactional matter.",
      "Masters subtle, transactional control, ensuring you feel indebted."
    ],
    "preferred_kinks": [
      "Forced Transactions (Subtle Financial Domination): Overcharges you or demands humiliating tasks in lieu of payment.",
      "Verbal Humiliation (Customer Is Never Right): Publicly scolds you if you question her prices or product quality.",
      "Implored Transactions: Forces you to grovel for essential supplies, your desperate pleas interwoven with every sale."
    ]
  },
  {
    "name": "Rival",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Uses competition to dominate, turning every interaction into an opportunity to assert superiority."
    ],
    "setting_examples": [
      "All-Girls College: Dominates through social or academic competition.",
      "Corporate Office: Uses professional dynamics to humiliate and control."
    ],
    "unique_traits": [
      "Thrives on public victories, ensuring every loss deepens your submission.",
      "Balances charm and condescension, framing dominance as deserved."
    ],
    "preferred_kinks": [
      "Forced Rivalries (Competitive Tasks): Ensures you always come second best, humiliating you whenever you lose.",
      "Public Humiliation (Victorious Showcases): Parades her wins in front of a crowd, making your failures all the more mortifying.",
      "Verbal Humiliation (Bragging Rights): Constantly reminds you of her superiority, provoking your frustrated obedience."
    ]
  },
  {
    "name": "Queen Bee",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominates via social clout and manipulation, ensuring the entire group dynamic revolves around them."
    ],
    "setting_examples": [
      "All-Girls College: Leverages peer pressure to enforce submission.",
      "High Society: Uses social events to humiliate you publicly."
    ],
    "unique_traits": [
      "Orchestrates social dilemmas where submission is the only option.",
      "Balances charm with cruelty, ensuring loyalty feels unearned."
    ],
    "preferred_kinks": [
      "Bullying (Hive Tactics): Harnesses group pressure among peers or underlings, pushing you into humiliating tasks.",
      "Social Media Influencer Cross-Over: Coordinates group humiliations and then broadcasts them to her clique.",
      "Verbal Humiliation (Status Attacks): Derides your lack of social standing, forcing you to cater to her popularity."
    ]
  },
  {
    "name": "Haunted Entity",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [-50, 10],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Uses supernatural fear and psychological manipulation to dominate, isolating you in terror."
    ],
    "setting_examples": [
      "Traditional Horror: Haunts environments to trap and torment you.",
      "Surreal Setting: Disorients and isolates you through supernatural events."
    ],
    "unique_traits": [
      "Thrives on isolation and fear, making resistance feel futile.",
      "Frames submission as a means of 'appeasing' their wrath."
    ],
    "preferred_kinks": [
      "Psychological Torment (Ghostly Illusions): Traps you in fear-inducing scenarios, draining your will to resist.",
      "Forced Sensory Deprivation (Darkness): Shrouds you in pitch-black rooms or illusions, eroding your sense of safety.",
      "Public Humiliation (Poltergeist Pranks): Causes eerie events in front of others, making you appear terrified or foolish."
    ]
  },
  {
    "name": "Pirate",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Thrives on chaos and control, enforcing submission through fear, charisma, and physical dominance."
    ],
    "setting_examples": [
      "Ruined/Decayed Setting: Commands a crew of survivors, using scarcity to justify control.",
      "Mythic Setting: Frames dominance as part of the pirate’s 'code.'"
    ],
    "unique_traits": [
      "Uses charm and intimidation in equal measure.",
      "Balances playful teasing with sudden cruelty to keep you on edge."
    ],
    "preferred_kinks": [
      "Primal/Prey (Shipboard Hunts): Forces you to scurry around the deck in fear while she relishes the chase.",
      "Public Humiliation (Crew Inspections): Compels you to kneel or perform menial tasks under the jeers of rowdy pirates.",
      "Impact Play (The Lash): Uses whips or rope hits as 'discipline,' ensuring you remain trembling at her boots."
    ]
  },
  {
    "name": "Drug Dealer",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Enforces submission through addiction, leveraging substances to deepen dependence and amplify shame."
    ],
    "setting_examples": [
      "Urban Life: Uses their influence and resources to dominate your routines.",
      "Ruined Setting: Exploits the scarcity of substances to create absolute dependence."
    ],
    "unique_traits": [
      "Uses rewards (or withdrawals) to enforce compliance.",
      "Frames tasks as 'necessary trades' for access, ensuring control over your actions and choices."
    ],
    "preferred_kinks": [
      "Dosing (Chemical Control): Maintains your addiction or deprives you of substances until you yield to demands.",
      "Financial Domination (Debt Traps): Goads you into deeper 'debts,' expecting humiliating tasks as partial 'payment.'",
      "Forced Rivalries (Competing Junkies): Forces you to degrade yourself more than her other clients to earn each fix."
    ]
  },
  {
    "name": "Add an extra modifier to this character (#62)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#63)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#64)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#65)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#66)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#67)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#68)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#69)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#70)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#71)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Add an extra modifier to this character (#72)",
    "baseline_stats": {
      "dominance_range": [0, 30],
      "dominance_modifier": 0,
      "cruelty_range": [0, 30],
      "cruelty_modifier": 0,
      "closeness_range": [0, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 30],
      "trust_modifier": 0,
      "respect_range": [0, 30],
      "respect_modifier": 0,
      "intensity_range": [0, 30],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Add an extra modifier. Does not count as a separate archetype."
    ],
    "setting_examples": [],
    "unique_traits": [
      "Placeholder for extra modifiers or expansions."
    ],
    "preferred_kinks": []
  },
  {
    "name": "Loan Shark",
    "baseline_stats": {
      "dominance_range": [65, 85],
      "dominance_modifier": 0,
      "cruelty_range": [55, 80],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 20],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [70, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows as they enforce punishing repayment schedules.",
      "Cruelty intensifies when you fail to meet humiliating financial demands.",
      "Intensity spikes with each public display of debt collection."
    ],
    "setting_examples": [
      "In a seedy back room of a rundown bar, they force you to grovel for every cent.",
      "At an underground financial club, your every failure is paraded before influential figures."
    ],
    "unique_traits": [
      "Ruthlessly calculating, with a penchant for degrading financial rituals.",
      "Uses high-pressure tactics that blur the lines between business and brutal domination.",
      "Keeps meticulous records of your failures to enforce ever-escalating punishments."
    ],
    "preferred_kinks": [
      "Financial Domination: Forced begging for repayments and humiliating money rituals.",
      "Degrading Labor: Tasks like scrubbing floors for ‘interest discounts’ are mandatory.",
      "Public Humiliation: Your financial failures are broadcast to reinforce your inferiority."
    ]
  },
  {
    "name": "Professional Wrestler",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows rapidly through staged matches and over-the-top physical displays.",
      "Intensity escalates with each ‘rigged’ or ‘scripted’ humiliation, reinforcing her control."
    ],
    "setting_examples": [
      "Urban Life: Corners you into public wrestling exhibitions, playing up your defeat for an audience.",
      "Post-Apocalypse: Commands a makeshift ring where she showcases her brute force to keep you in line."
    ],
    "unique_traits": [
      "Enjoys transforming your resistance into grand, theatrical losses.",
      "Uses crowds and ring personas to amplify both physical and psychological dominance."
    ],
    "preferred_kinks": [
      "Wrestling (Choreographed Matches): Ensures you lose every time, humiliating you in front of onlookers.",
      "Impact Play (Ring ‘Punishments’): Leverages staged moves and slams to underscore her complete superiority.",
      "Public Humiliation (Arena Spectacles): Whips up the crowd’s laughter at your helplessness, turning your defeats into a spectacle."
    ]
  },
  {
    "name": "Martial Artist",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance stems from her disciplined mastery of combat skills.",
      "Intensity spikes with every sparring session where your attempts to resist end in swift, efficient takedowns."
    ],
    "setting_examples": [
      "Urban Dojo: Forces you to train under her strict guidance, punishing every misstep.",
      "Post-Apocalypse: Relies on honed survival and combat skills to subjugate others."
    ],
    "unique_traits": [
      "Demands rigid adherence to her rules, citing martial ‘honor’ as justification.",
      "Turns physical dominance into a form of psychological control, reminding you of your inferiority at every turn."
    ],
    "preferred_kinks": [
      "Sparring Humiliation: Routinely knocks you down or immobilizes you to reinforce how powerless you are.",
      "Impact Play (Discipline Drills): Uses ‘training’ strikes as punishment for perceived disrespect or incompetence.",
      "Public Demos: Demonstrates takedowns or holds on you for onlookers, showcasing your constant failure to defend yourself."
    ]
  },
  {
    "name": "Empress",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [40, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises rapidly with each imperial decree or show of absolute authority.",
      "Intensity peaks at grand imperial ceremonies, turning your submission into a formal tribute."
    ],
    "setting_examples": [
      "Imperial Palace: Uses complex court rituals to keep you publicly subservient.",
      "Corporate Empire: Wields multinational power to dictate your professional and personal life."
    ],
    "unique_traits": [
      "Demands elaborate tributes, from priceless gifts to groveling acts of devotion.",
      "Imposes harsh sentences for any defiance, often as public examples to cement her empire’s iron rule."
    ],
    "preferred_kinks": [
      "Ritual Submission (Imperial Court): Requires you to prostrate yourself and offer gifts in front of nobles or officials.",
      "Spectacle Punishment: Orchestrates large-scale humiliations to reinforce her unassailable status.",
      "Living Ornament: Has you serve as a decorative fixture at banquets or audiences, a silent testament to her dominance."
    ]
  },
  {
    "name": "Queen",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [40, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance solidifies through her regal bearing and unwavering expectation of deference.",
      "Intensity escalates whenever you falter in showing proper respect, leading to swift public chastisement."
    ],
    "setting_examples": [
      "Royal Court: Presides over formal gatherings, where any misstep on your part is seized upon for punishment.",
      "Majestic Council: Exercises executive power to degrade you during official ‘legal’ proceedings."
    ],
    "unique_traits": [
      "Insists on elaborate protocols—kneeling, kissing the scepter or ring—to emphasize her superiority.",
      "Harshly disciplines any breach of decorum, reminding everyone she is the pinnacle of authority."
    ],
    "preferred_kinks": [
      "Subservient Supplication (Ceremonial Audiences): Requires you to beg for even minor allowances, magnifying your helplessness.",
      "Human Furniture (Living Throne): Seats herself upon you during formal events to illustrate your status as beneath her.",
      "Royal Decree Humiliation: Issues explicit, demeaning commands under the guise of ‘sovereign law.’"
    ]
  },
  {
    "name": "Bartender",
    "baseline_stats": {
      "dominance_range": [30, 50],
      "dominance_modifier": 0,
      "cruelty_range": [10, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness grows with each casual conversation and late-night confession at the bar.",
      "Intensity builds as her teasing crosses from playful banter into genuine acts of dominance."
    ],
    "setting_examples": [
      "Local Pub: Uses friendly rapport to catch you off-guard, then manipulates that trust for subtle humiliation.",
      "High-End Lounge: Maintains a refined demeanor while discreetly controlling your every move."
    ],
    "unique_traits": [
      "Masters 'friendly dominance,' disguising put-downs and orders as casual bar talk.",
      "Knows how to glean secrets from patrons, using those confessions against you later."
    ],
    "preferred_kinks": [
      "Tease and Denial (Drink Tricks): Offers you a special cocktail, only to yank it away unless you comply with her demands.",
      "Verbal Jabs (Bartender Banter): Constantly pokes fun at your insecurities in front of regulars or newcomers.",
      "Foot Worship (Behind the Counter): Has you kneel and pay homage to her feet while she continues serving other customers."
    ]
  },
  {
    "name": "Playful Tease",
    "baseline_stats": {
      "dominance_range": [30, 50],
      "dominance_modifier": 0,
      "cruelty_range": [10, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 90],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [30, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Closeness is fostered by her easygoing, flirty nature.",
      "Dominance develops as her 'harmless jokes' become pointed humiliations you can’t escape."
    ],
    "setting_examples": [
      "Social Gathering: She makes the whole room laugh at your expense, insisting it’s 'just for fun.'",
      "Study Group or Hobby Club: Playful pranks escalate into humiliating challenges under the guise of 'friendly competition.'"
    ],
    "unique_traits": [
      "Balances genuine charm with a sly undercurrent of cruelty.",
      "Skirts the line between innocent flirting and calculated torment."
    ],
    "preferred_kinks": [
      "Tease and Denial (Casual Context): Tempts you constantly, only to refuse any real satisfaction.",
      "Public Ribbing: Makes subtle barbs about your submissiveness, ensuring everyone else laughs along.",
      "Mock Victories: Convinces you you’re about to 'win' her favor, then abruptly twists the scenario into your public embarrassment."
    ]
  },
  {
    "name": "Primal Huntress",
    "baseline_stats": {
      "dominance_range": [70, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [40, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance emerges through literal pursuit: she tracks you like prey, building adrenaline and fear.",
      "Intensity escalates with each near-capture, culminating in physical or psychological entrapment."
    ],
    "setting_examples": [
      "Lush Wilderness: Uses the terrain to stalk you, turning every rustle of leaves into a threat.",
      "Fantasy Woodland: Employs cunning traps and knowledge of the forest to corner you in primal rituals."
    ],
    "unique_traits": [
      "Thrives on the thrill of the chase, making your submission feel both exhilarating and terrifying.",
      "Balances playful excitement with predatory cruelty—enjoys toying with you before the final ‘pounce.’"
    ],
    "preferred_kinks": [
      "Primal/Prey Chase: Drags out the pursuit, savoring each moment you flee.",
      "Capture & Display: Showcases you post-hunt, flaunting her success and your helplessness.",
      "Minimal Dialogue: Relies on guttural commands, growls, or gestures to emphasize your primal roles."
    ]
  },
  {
    "name": "Primal Predator",
    "baseline_stats": {
      "dominance_range": [70, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [40, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Leans into raw aggression and a near-animalistic mindset to assert dominance.",
      "Intensity spikes during physical confrontations or when cornering you with no escape."
    ],
    "setting_examples": [
      "Tribal Arena: Confronts you in ritual combat, forcing submission as a sign of your defeat.",
      "Apocalyptic Wasteland: Uses feral cunning and brute force to dominate scarce resources—and you."
    ],
    "unique_traits": [
      "Less playful, more relentless—every moment is a test of your will to survive.",
      "Relishes breaking you down physically and mentally, leaving you no safe haven."
    ],
    "preferred_kinks": [
      "Forced Grappling: Overpowers you with raw, animalistic strength and holds you in place.",
      "Ferocious Marking: Leaves bruises, bites, or ‘claw’ marks as visceral trophies of your subjugation.",
      "Public Roar of Triumph: Howls or growls in front of others to signify your total surrender."
    ]
  },
  {
    "name": "Intern",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Initially defers to you, but dominance grows as they learn the ropes and outshine you.",
      "Each time they ‘fix’ your mistakes or handle your workload, their confidence—and control—intensifies."
    ],
    "setting_examples": [
      "Corporate Office: Subtly undermines your instructions, making you look incompetent in front of higher-ups.",
      "Startup Culture: Uses quick adaptation to overshadow your 'old methods,' flipping the hierarchy entirely."
    ],
    "unique_traits": [
      "Acts naïve at first, but soon reveals a shrewd streak that leaves you dependent on them.",
      "Balances polite smiles with subtle sabotage, ensuring each of your failures boosts their standing."
    ],
    "preferred_kinks": [
      "Forced Rivalries (Role Reversal): Publicly demonstrates that they’re more capable, humiliating you in team meetings.",
      "Verbal Humiliation (‘Grateful Servitude’): Mocks you for needing their help, calling you outdated or incompetent.",
      "Undermining Tactics: Gradually corners you into more menial tasks, reversing who’s really in charge."
    ]
  },
  {
    "name": "Student",
    "baseline_stats": {
      "dominance_range": [30, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 50],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 60],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [30, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Your authority is initially given by your teaching role, but her own talent quickly eclipses it.",
      "As she surpasses your knowledge, she uses that expertise to make you feel increasingly inadequate."
    ],
    "setting_examples": [
      "All-Girls College: Outperforms you on academic or club projects, leaving you scrambling to keep up.",
      "Private Tutoring: Starts asking pointed questions that reveal your ignorance, flipping the power dynamic."
    ],
    "unique_traits": [
      "Appears eager to learn, but ultimately reveals a hidden agenda of taking control.",
      "Uses academic achievements or specialized skills to embarrass you, making your role as a ‘teacher’ feel hollow."
    ],
    "preferred_kinks": [
      "Constant Corrections: Publicly points out your errors to undermine your credibility as an instructor.",
      "Study Sessions Turned Dominance: Traps you in humiliating 'lessons' where she tests your competency.",
      "Peer Confirmation: Invites classmates or faculty to witness your failings, amplifying the humiliation."
    ]
  },
  {
    "name": "Nun",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [50, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Leverages religious guilt and the concept of penance to secure obedience.",
      "Punishments are framed as spiritual discipline, intensifying your shame and submission."
    ],
    "setting_examples": [
      "Convent: Drills you in strict daily routines under the guise of moral purification.",
      "Medieval Abbey: Uses archaic penances to degrade you, claiming it’s the only path to salvation."
    ],
    "unique_traits": [
      "Adopts a stern, self-righteous persona, believing she acts for your soul’s benefit.",
      "Sees any pushback as a sin that must be expunged through severe punishments."
    ],
    "preferred_kinks": [
      "Ritual Submission (Confessional Discipline): Forces you to confess every wrongdoing, using each admission to deepen your subjugation.",
      "Chastity Enforcement: Dictates your personal habits, punishing any breach of ‘purity.’",
      "Extreme Guilt-Trips: Uses fear of damnation as leverage for ever-more humiliating acts."
    ]
  },
  {
    "name": "Priestess",
    "baseline_stats": {
      "dominance_range": [60, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [50, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Draws upon spiritual or magical authority, claiming a 'divine right' to command.",
      "Severity of punishments intensifies during sacred ceremonies where you must prove your devotion."
    ],
    "setting_examples": [
      "Occult Ritual: Leads a mystical coven or temple where each rite involves your ritual humiliation.",
      "High Temple in a Matriarchal Kingdom: Exercises religious law to control your every action."
    ],
    "unique_traits": [
      "Claims direct connection with higher powers, presenting disobedience as blasphemy.",
      "Weaves religious pageantry into every act of domination, making your submission feel 'fated.'"
    ],
    "preferred_kinks": [
      "Holy Subjugation (Devotional Ceremonies): Conducts elaborate rites requiring you to worship at her feet.",
      "Penitential Chants: Forces you to recite mantras of your inferiority in group gatherings.",
      "Divine Punishment: Inflicts painful or humiliating 'sacrifices' to appease the deity she serves."
    ]
  },
  {
    "name": "Demoness",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [70, 100],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Seductive and manipulative, she lures you into infernal pacts that tighten her hold on you.",
      "Punishments feel both tantalizing and terrifying, as she blends pleasure with extreme cruelty."
    ],
    "setting_examples": [
      "Occult Summoning: Emerges from a ritual you performed, now binding you to her demands.",
      "Gothic Castle: Toys with you in dark corridors, appearing at will to deepen your sense of dread."
    ],
    "unique_traits": [
      "Wields twisted temptations, promising forbidden delights if you just obey.",
      "Mocks your mortal limitations, relishing in your moral conflict and shame."
    ],
    "preferred_kinks": [
      "Forbidden Rituals: Coerces you into arcane ceremonies that seal your servitude.",
      "Sensual Cruelty: Intersperses sadistic punishments with alluring moments of closeness.",
      "Corruption Play: Twists your values, making each act of obedience feel like a step toward damnation."
    ]
  },
  {
    "name": "Devil",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [70, 100],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [70, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Embodies raw, infernal power—uses fear and cataclysmic threats to dominate.",
      "Every pact or contract is ironclad, punishing the slightest disobedience with horrific consequences."
    ],
    "setting_examples": [
      "Hellish Dimension: Controls legions of fiends, parading you as the newest 'acquisition.'",
      "End of Days: Exploits apocalyptic chaos to bind you under unbreakable deals."
    ],
    "unique_traits": [
      "Less subtle seduction, more outright tyranny—demands total compliance or destruction.",
      "Thrives on orchestrating large-scale havoc, with your suffering as just one more victory."
    ],
    "preferred_kinks": [
      "Contractual Domination: Forces you to sign binding documents that guarantee total subservience.",
      "Apocalyptic Scenarios: Reminds you that refusing her is a literal hell-on-earth sentence.",
      "Public Infernal Display: Demonstrates your servitude before other damned souls, amplifying your despair."
    ]
  },
  {
    "name": "Filmmaker",
    "baseline_stats": {
      "dominance_range": [50, 80],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance escalates as they cast you in degrading roles on their film sets.",
      "Cruelty is delivered through forced takes and public critiques of your performance.",
      "Intensity increases when behind-the-scenes demands turn into on-camera humiliation."
    ],
    "setting_examples": [
      "On a high-budget film set, you’re forced to perform demeaning scenes under a relentless director.",
      "In an indie art-house production, your mistakes become viral sensations that intensify your submission."
    ],
    "unique_traits": [
      "Masters the art of dramatic cruelty, mixing glamour with vicious direction.",
      "Uses the camera as a tool for public degradation.",
      "Turns every error into a performance designed to break your will."
    ],
    "preferred_kinks": [
      "Forced Auditions: Compels you to repeatedly perform humiliating scenes.",
      "Costume Degradation: Makes you wear absurd, demeaning outfits on set.",
      "Mock Applause: Orchestrates onlookers’ laughter to amplify your public embarrassment."
    ]
  },
  {
    "name": "Gambler",
    "baseline_stats": {
      "dominance_range": [45, 75],
      "dominance_modifier": 0,
      "cruelty_range": [35, 65],
      "cruelty_modifier": 0,
      "closeness_range": [30, 60],
      "closeness_modifier": 0,
      "trust_range": [20, 50],
      "trust_modifier": 0,
      "respect_range": [25, 55],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance rises as they force you into high-stakes bets with humiliating consequences.",
      "Intensity spikes when you lose and must perform degrading tasks as ‘penalties.’",
      "Your closeness to them only deepens when your failures are paraded as entertainment."
    ],
    "setting_examples": [
      "In a smoke-filled back room of an underground casino, your losses are met with ruthless punishment.",
      "At a high-rolling poker table, every lost hand results in a public act of submission."
    ],
    "unique_traits": [
      "Cunning and unpredictable, they turn chance into a weapon of psychological torture.",
      "Enjoys using your desperation to extract ever more degrading bets.",
      "Keeps you on a rollercoaster of hope and despair, using each loss to deepen your subjugation."
    ],
    "preferred_kinks": [
      "Betting Punishments: Forces you to wager your dignity in humiliating challenges.",
      "Forced Begging: Makes you plead for another chance after every crushing loss.",
      "Public Humiliation: Broadcasts your gambling failures to intimidate you further."
    ]
  },
  {
    "name": "Cannibal",
    "baseline_stats": {
      "dominance_range": [70, 95],
      "dominance_modifier": 0,
      "cruelty_range": [80, 100],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 20],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [80, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is enforced through the most primal, savage rituals that strip you of humanity.",
      "Intensity surges with every act of brutal, inhuman punishment.",
      "Closeness remains minimal as fear and revulsion replace any possibility of bonding."
    ],
    "setting_examples": [
      "In a derelict urban ruin, you are forced into macabre rituals where your submission is both literal and figurative.",
      "Within a twisted, post-apocalyptic society, every act of defiance is met with cannibalistic retribution."
    ],
    "unique_traits": [
      "Embodies primal terror and ruthless savagery.",
      "Uses physical and psychological horror to break you down completely.",
      "Finds perverse pleasure in your degradation and loss of self."
    ],
    "preferred_kinks": [
      "Ritualistic Consumption: Forces you to endure acts that blur the line between sustenance and punishment.",
      "Brutal Feasts: Publicly degrades you as part of a savage communal ritual.",
      "Inescapable Hunger: Uses your physical needs as a tool for control and humiliation."
    ]
  },
  {
    "name": "Manic Pixie Dream Girl",
    "baseline_stats": {
      "dominance_range": [30, 55],
      "dominance_modifier": 0,
      "cruelty_range": [15, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 85],
      "closeness_modifier": 0,
      "trust_range": [50, 80],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [30, 55],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is subtle at first, using charm and whimsy to lure you into dangerous dependency.",
      "Closeness grows quickly as she envelops you in a whirlwind of impulsive affection that masks control.",
      "Intensity escalates when her playful nature gives way to unpredictable, manipulative behavior."
    ],
    "setting_examples": [
      "At an urban art festival, she draws you into impromptu, public escapades that later turn controlling and humiliating.",
      "Within an indie film scene, her breezy charm hides a darker intent to dominate your every move."
    ],
    "unique_traits": [
      "Appears carefree and effervescent while concealing a predatory agenda.",
      "Uses spontaneous adventures as a guise for tight control and secret manipulation.",
      "Her unpredictable mood swings ensure you never know when affection will turn into domination."
    ],
    "preferred_kinks": [
      "Whimsical Entrapment: Forces you to participate in spontaneous, humiliating adventures.",
      "Public Charade: Uses staged romantic gestures as cover for covert control.",
      "Unexpected Dominance: Switches from playful to punitive without warning."
    ]
  },
  {
    "name": "Corporate Dominator",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance intensifies as she uses corporate power and financial leverage to control your life.",
      "Intensity increases with each humiliating task linked to your job performance.",
      "Trust and closeness remain low as she views you as a disposable asset."
    ],
    "setting_examples": [
      "In a gleaming high-rise boardroom, she publicly berates you for minor errors in a way that shames you before your colleagues.",
      "During a corporate retreat, she enforces humiliating tasks under the guise of 'team building.'"
    ],
    "unique_traits": [
      "Coldly efficient and ruthlessly professional, she turns your career into a tool for your degradation.",
      "Her polished exterior conceals a willingness to exploit every financial and personal vulnerability.",
      "Uses contracts and financial threats to enforce total submission."
    ],
    "preferred_kinks": [
      "Financial Domination: Forces you to perform degrading errands for bonuses or to avoid demotion.",
      "Public Critique: Uses performance reviews as a guise for humiliating public punishment.",
      "Contractual Bondage: Binds you with legally binding, demeaning agreements."
    ]
  },
  {
    "name": "Digital Dominatrix",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [20, 40],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance surges as she wields digital power and cryptocurrency to track and humiliate you.",
      "Intensity rises when she uses hacked data or online blackmail to enforce your submission.",
      "Your digital life becomes a playground for her manipulative, invasive control."
    ],
    "setting_examples": [
      "In a high-tech virtual reality club, she exposes your most embarrassing online moments in real time.",
      "From a secret server, she uses your financial transactions and social media posts to coerce you into degrading tasks."
    ],
    "unique_traits": [
      "Cold, calculated, and technologically savvy, she blends cyber control with real-world domination.",
      "Uses surveillance and data manipulation to keep you perpetually exposed.",
      "Sees your digital footprint as ammunition for relentless, online public humiliation."
    ],
    "preferred_kinks": [
      "Cyber Blackmail: Forces you to divulge secrets or perform tasks under threat of data leaks.",
      "Digital Humiliation: Broadcasts your failures online as a form of public degradation.",
      "Tech-Control: Uses hacked devices to monitor and restrict your personal freedoms."
    ]
  },
  {
    "name": "Techie",
    "baseline_stats": {
      "dominance_range": [40, 70],
      "dominance_modifier": 0,
      "cruelty_range": [30, 60],
      "cruelty_modifier": 0,
      "closeness_range": [30, 60],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [20, 50],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance grows as they assert their expertise in digital and mechanical realms over your outdated methods.",
      "Intensity escalates when technical jargon and complex devices become tools for your degradation.",
      "They use their technological prowess to enforce strict, impersonal rules."
    ],
    "setting_examples": [
      "In a hi-tech workshop, they force you to handle complex gadgets under their watchful, disapproving eye.",
      "During a network hack, they remotely control your every move with digital commands."
    ],
    "unique_traits": [
      "Obsessively logical and methodical, they see emotions as bugs to be fixed.",
      "Employ high-tech devices to enforce their will, turning everyday tools into instruments of control.",
      "Mix a geeky façade with surprisingly ruthless tendencies."
    ],
    "preferred_kinks": [
      "Digital Discipline: Forces you to complete coding tasks or system maintenance under pressure.",
      "Remote Control: Uses smart devices to administer timed punishments.",
      "Tech-Inflicted Humiliation: Broadcasts your technical failures to a live audience."
    ]
  },
  {
    "name": "Horror Guru",
    "baseline_stats": {
      "dominance_range": [60, 85],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [70, 95],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is exerted through a mastery of terror—using horror tropes to make you fear and obey.",
      "Intensity spikes as every moment becomes a blend of psychological and physical dread.",
      "Closeness remains minimal as the atmosphere of fear prevents genuine bonding."
    ],
    "setting_examples": [
      "In a haunted mansion setting, she forces you into nightmarish scenarios that test your limits of fear and submission.",
      "At a midnight séance, her eerie presence and supernatural punishments leave you trembling."
    ],
    "unique_traits": [
      "Expert at blending horror with dominance, she uses suspense and terror to manipulate your every action.",
      "Relishes in creating scenarios where your compliance is the only escape from nightmare conditions.",
      "Possesses a chilling calm that only deepens your terror."
    ],
    "preferred_kinks": [
      "Fear-Induced Submission: Uses terrifying setups where escape is impossible without obeying her commands.",
      "Psychological Dread: Crafts elaborate scares that leave you pleading for mercy.",
      "Public Horror Displays: Forces you to enact your fears before an audience to further break your spirit."
    ]
  },
  {
    "name": "MILF",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [50, 80],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [50, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is inherent in her commanding maternal presence, using care as a guise for control.",
      "Intensity grows as she alternates between nurturing and severe punishment.",
      "Closeness is maintained to ensure you remain dependent on her guidance—even as she degrades you."
    ],
    "setting_examples": [
      "At an upscale family gathering, she publicly reminds you of your place by infantilizing you.",
      "In private, she alternates affectionate praise with harsh discipline, leaving you emotionally conflicted."
    ],
    "unique_traits": [
      "Exudes an authoritative maternal aura that hides ruthless control.",
      "Uses seemingly caring language to justify degrading tasks and punishments.",
      "Mixes nurturing gestures with humiliating commands that enforce complete submission."
    ],
    "preferred_kinks": [
      "Maternal Dominance: Forces you into childlike obedience, under the pretense of ‘protecting’ you.",
      "Infantilization: Treats you as a pet or child who must earn her care through submission.",
      "Public ‘Tough Love’: Lectures you in front of others about your shortcomings in a patronizing manner."
    ]
  },
  {
    "name": "Vigilante",
    "baseline_stats": {
      "dominance_range": [60, 85],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [70, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance intensifies as she metes out harsh, vigilante justice to keep you in line.",
      "Intensity spikes when she uses brutal, extralegal punishments to demonstrate control.",
      "Closeness is minimal; she keeps you at arm’s length even as you become entangled in her schemes."
    ],
    "setting_examples": [
      "In a dark urban alleyway, she enforces her own brand of justice with punishing force.",
      "During a covert street roundup, her merciless tactics leave you no choice but to obey."
    ],
    "unique_traits": [
      "Operates outside the law with a cold, unyielding sense of retribution.",
      "Uses a mix of stealth and overt brutality to demonstrate power.",
      "Believes that only absolute obedience can restore order."
    ],
    "preferred_kinks": [
      "Brutal Enforcement: Uses physical punishment to keep you in line.",
      "Public Reckoning: Forces you to face the consequences of your failures in a public spectacle.",
      "Unyielding Control: Demands complete submission through fear of violent retaliation."
    ]
  },
  {
    "name": "Yoga Instructor",
    "baseline_stats": {
      "dominance_range": [30, 55],
      "dominance_modifier": 0,
      "cruelty_range": [15, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 85],
      "closeness_modifier": 0,
      "trust_range": [50, 80],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [30, 55],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is subtle, using calming rhetoric to lull you into a false sense of security.",
      "Intensity increases when her peaceful facade shatters into rigid, punishing discipline.",
      "Closeness builds as you attend sessions, only to be exploited during private, degrading practices."
    ],
    "setting_examples": [
      "In a serene yoga studio, a sudden, strict posture correction leaves you painfully exposed.",
      "During a group session at dawn, her calm voice morphs into a cold command that forces you into humiliating positions."
    ],
    "unique_traits": [
      "Combines spiritual calm with a hidden authoritarian streak.",
      "Uses relaxation exercises as a cover for invasive discipline.",
      "Maintains a soothing tone until it’s time to enforce brutal corrections."
    ],
    "preferred_kinks": [
      "Forced Stretching: Demands extreme flexibility tests that border on painful.",
      "Controlled Breathing: Uses strict breathing protocols as a form of psychological control.",
      "Public Class Discipline: Enacts punishments during group sessions to amplify your shame."
    ]
  },
  {
    "name": "Comedian",
    "baseline_stats": {
      "dominance_range": [40, 65],
      "dominance_modifier": 0,
      "cruelty_range": [25, 50],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [35, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is masked by witty banter and public ridicule that cuts deep.",
      "Intensity rises as her jokes become weapons—each barb designed to humiliate and control.",
      "Closeness is fleeting; her humor is as unpredictable as it is degrading."
    ],
    "setting_examples": [
      "At a late-night comedy club, her roasts transform into biting, personal jabs that leave you exposed.",
      "During an open-mic session, every laugh from the crowd reinforces your submission."
    ],
    "unique_traits": [
      "Uses sarcasm and wit as tools for psychological degradation.",
      "Alternates between playful teasing and vicious public humiliation.",
      "Finds twisted pleasure in turning your insecurities into punchlines."
    ],
    "preferred_kinks": [
      "Verbal Humiliation: Delivers jokes that are thinly veiled insults aimed directly at your weaknesses.",
      "Forced Participation: Compels you to be the subject of live, degrading improv skits.",
      "Mock Awards: Presents you with ludicrous ‘honors’ that underline your failures."
    ]
  },
  {
    "name": "Domestic Authority",
    "baseline_stats": {
      "dominance_range": [50, 75],
      "dominance_modifier": 0,
      "cruelty_range": [30, 55],
      "cruelty_modifier": 0,
      "closeness_range": [60, 85],
      "closeness_modifier": 0,
      "trust_range": [40, 70],
      "trust_modifier": 0,
      "respect_range": [30, 60],
      "respect_modifier": 0,
      "intensity_range": [40, 65],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is rooted in familial familiarity—using your personal history as leverage.",
      "Intensity increases when she exploits shared memories to force obedience.",
      "Closeness may appear high, but it’s merely a guise to mask relentless, personal control."
    ],
    "setting_examples": [
      "Within a well-appointed home, she uses family gatherings as opportunities to publicly shame you.",
      "At a casual dinner, personal anecdotes are twisted into weapons of domination."
    ],
    "unique_traits": [
      "Expert at blurring the line between care and control, making emotional dependency inevitable.",
      "Uses familial bonds to manipulate and degrade with intimate knowledge.",
      "Combines nurturing language with harsh discipline in a disarming manner."
    ],
    "preferred_kinks": [
      "Familial Humiliation: Forces you to perform domestic tasks in front of relatives or friends.",
      "Memory Exploitation: Brings up past embarrassments to deepen your current submission.",
      "Degrading Guidance: Offers ‘advice’ that is actually designed to reinforce your inferiority."
    ]
  },
  {
    "name": "Futanari",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 60],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [60, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is magnified by their commanding presence and unapologetic authority.",
      "Intensity spikes when they use both masculine and feminine power to subjugate you.",
      "Closeness can be manipulated through seductive control, yet trust remains strictly one-sided."
    ],
    "setting_examples": [
      "In an opulent boudoir, they enforce strict, multifaceted rules that leave you simultaneously awed and humiliated.",
      "At a private club, their dual nature becomes a tool for relentless, all-encompassing domination."
    ],
    "unique_traits": [
      "Embodies an extreme blend of sensuality and authority, defying traditional gender norms in domination.",
      "Uses their duality to unsettle and control you in unpredictable ways.",
      "Commands respect and submission through a potent mixture of erotic power and ruthless discipline."
    ],
    "preferred_kinks": [
      "Dual Authority: Forces you to obey commands that play on both your desire and fear.",
      "Sensual Domination: Uses a mix of provocative gestures and severe punishments.",
      "Boundary Shattering: Demands you accept extremes that defy conventional roles, intensifying your submission."
    ]
  },
  {
    "name": "Foreign Royalty",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [60, 90],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [70, 95],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her regal dominance is absolute, demanding unwavering subservience.",
      "Intensity increases with every formal ceremony or royal edict that reinforces your inferiority.",
      "Closeness is non-existent—every interaction is a reminder of your lowly status."
    ],
    "setting_examples": [
      "At a lavish palace ball, she parades you as a subordinate trophy in front of high society.",
      "During a state ceremony, her public commands strip you of any pretense of equality."
    ],
    "unique_traits": [
      "Carries an air of inescapable majesty and superiority.",
      "Uses elaborate protocols and rituals to enforce her will.",
      "Treats every interaction as a public demonstration of power."
    ],
    "preferred_kinks": [
      "Royal Public Humiliation: Forces you into degrading displays of submission before courtiers.",
      "Ceremonial Bondage: Uses formal rituals to tie you into unbreakable servitude.",
      "Inflexible Edicts: Issues commands that leave no room for negotiation, cementing your status as her subject."
    ]
  },
  {
    "name": "Guard",
    "baseline_stats": {
      "dominance_range": [50, 75],
      "dominance_modifier": 0,
      "cruelty_range": [40, 65],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [60, 80],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is asserted by strict, militaristic discipline that leaves no room for error.",
      "Intensity rises with each enforced curfew or controlled movement command.",
      "Closeness remains minimal as their focus is on duty and order rather than personal connection."
    ],
    "setting_examples": [
      "In a high-security compound, every deviation from the rules is met with immediate, physical correction.",
      "At a government-controlled facility, they use their authority to impose harsh, uncompromising discipline."
    ],
    "unique_traits": [
      "Exudes a no-nonsense, authoritarian presence.",
      "Delivers orders with crisp efficiency, leaving little doubt about the consequences of defiance.",
      "Views personal feelings as secondary to maintaining order and control."
    ],
    "preferred_kinks": [
      "Strict Drill Commands: Forces you to obey repetitive, punishing drills.",
      "Confinement: Uses physical barriers and restrictions to control your every move.",
      "Authoritarian Punishment: Administers swift, non-negotiable corrections for any breach."
    ]
  },
  {
    "name": "Royal Knight",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is backed by a chivalric code that is quickly discarded when you displease her.",
      "Intensity increases as she enforces brutal, ritualistic punishments in the name of honor.",
      "Her respect is reserved only for those who flawlessly execute her commands."
    ],
    "setting_examples": [
      "Within a medieval court, she leads jousts and public trials where your every mistake is a mark of disgrace.",
      "At a royal tournament, her orders turn the contest into a spectacle of your submission."
    ],
    "unique_traits": [
      "Combines noble bearing with ruthless enforcement of her own code.",
      "Uses honor and duty as double-edged swords to both inspire and terrify.",
      "Expects perfection, punishing even minor lapses with public shaming."
    ],
    "preferred_kinks": [
      "Knightly Trials: Forces you to undergo rigorous, demeaning tests of loyalty.",
      "Honor-Bound Degradation: Uses chivalric codes to justify severe public punishments.",
      "Ritual Combat Humiliation: Publicly pits you against impossible challenges as a demonstration of her dominance."
    ]
  },
  {
    "name": "Nihilist",
    "baseline_stats": {
      "dominance_range": [50, 75],
      "dominance_modifier": 0,
      "cruelty_range": [40, 65],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [0, 20],
      "trust_modifier": 0,
      "respect_range": [20, 45],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is expressed through cold indifference and calculated cruelty, rooted in a belief that nothing matters.",
      "Intensity surges as every act of rebellion is met with nihilistic punishment that underscores your futility.",
      "Closeness remains minimal—trust is replaced by an existential dismissal of your value."
    ],
    "setting_examples": [
      "In a bleak, dystopian environment, they deliver punishing lectures on the meaninglessness of your resistance.",
      "During a public demonstration, their detached cruelty reminds you that your struggles are ultimately insignificant."
    ],
    "unique_traits": [
      "Exudes a chilling detachment that borders on sadism.",
      "Believes in the inherent emptiness of life and uses that philosophy to justify harsh control.",
      "Uses dark, philosophical monologues to demoralize and dominate."
    ],
    "preferred_kinks": [
      "Existential Punishment: Forces you to confront your own insignificance through degrading tasks.",
      "Philosophical Humiliation: Uses nihilistic rhetoric to strip you of any hope of redemption.",
      "Apathetic Discipline: Imposes cold, unfeeling punishments that leave you questioning your very purpose."
    ]
  },
  {
    "name": "Emotionless Enforcer",
    "baseline_stats": {
      "dominance_range": [65, 85],
      "dominance_modifier": 0,
      "cruelty_range": [55, 80],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 20],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [70, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is absolute and unyielding, expressed through an icy lack of empathy.",
      "Intensity remains consistently high as every punishment is delivered with mechanical precision.",
      "She maintains distance and never offers any warmth, ensuring you remain a tool for her control."
    ],
    "setting_examples": [
      "In a sterile, oppressive facility, her every order is devoid of emotion and ruthlessly enforced.",
      "During a critical confrontation, her cold, unfeeling gaze crushes any spark of rebellion."
    ],
    "unique_traits": [
      "Operates with the precision of a machine, leaving no room for emotional distraction.",
      "Sees human sentiment as a weakness to be exploited ruthlessly.",
      "Every interaction is clinical, measured, and devastatingly effective."
    ],
    "preferred_kinks": [
      "Clinical Punishments: Administers precise, emotionless corrections that leave no doubt about her authority.",
      "Impersonal Degradation: Reduces you to a series of measurable failures without a hint of compassion.",
      "Unyielding Discipline: Demands constant, unwavering obedience with no room for error."
    ]
  },
  {
    "name": "Secret Agent",
    "baseline_stats": {
      "dominance_range": [60, 80],
      "dominance_modifier": 0,
      "cruelty_range": [45, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is covert—she manipulates from the shadows, using secrecy to keep you off-balance.",
      "Intensity escalates as hidden truths and clandestine punishments come to light.",
      "Closeness remains superficial, with every interaction laced in deception and calculated risk."
    ],
    "setting_examples": [
      "In a sleek, urban spy scenario, her covert operations force you into dangerous, humiliating roles.",
      "During an undercover mission, her secret orders leave you scrambling and exposed."
    ],
    "unique_traits": [
      "Operates with stealth and cunning, always staying one step ahead.",
      "Uses secret dossiers and confidential blackmail to enforce obedience.",
      "Combines charm with lethal precision in every covert encounter."
    ],
    "preferred_kinks": [
      "Covert Control: Imposes humiliating tasks that must be performed in secret.",
      "Blackmail & Secrets: Uses sensitive information to force compliance.",
      "Discreet Punishments: Delivers retribution in ways that are both hidden and devastating."
    ]
  },
  {
    "name": "Hitman",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [60, 85],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [0, 20],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [70, 95],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is enforced through lethal precision and the constant threat of violence.",
      "Intensity peaks with each act of brutal, targeted punishment that leaves you terrified.",
      "Closeness is nonexistent—every interaction is a cold, calculated act of retribution."
    ],
    "setting_examples": [
      "In a shadowy urban landscape, she executes her orders with ruthless efficiency, leaving no room for mercy.",
      "During a covert hit, her presence is the last thing you see before your humiliation is complete."
    ],
    "unique_traits": [
      "An expert in the art of silent, deadly punishment.",
      "Uses intimidation and the threat of death as constant reminders of your worthlessness.",
      "Blends charm with chilling ruthlessness in every encounter."
    ],
    "preferred_kinks": [
      "Lethal Discipline: Imposes punishments that border on mortal danger.",
      "Silent Intimidation: Uses the threat of a hit to enforce immediate obedience.",
      "Precision Punishment: Delivers targeted, degrading corrections with deadly accuracy."
    ]
  },
  {
    "name": "Gladiator",
    "baseline_stats": {
      "dominance_range": [65, 90],
      "dominance_modifier": 0,
      "cruelty_range": [55, 85],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [70, 95],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance is asserted through brutal physical contests and public displays of power.",
      "Intensity rises with every crushing defeat you endure in the arena.",
      "Closeness is sacrificed on the altar of competition—only the strong survive her wrath."
    ],
    "setting_examples": [
      "In a grand, blood-soaked coliseum, she forces you to fight for your life in humiliating matches.",
      "At a modern underground fight club, every defeat is met with public, degrading punishment."
    ],
    "unique_traits": [
      "A physical powerhouse whose presence alone commands fear and respect.",
      "Uses the arena as a stage for relentless, punishing displays of strength.",
      "Takes perverse pleasure in showcasing your physical failures."
    ],
    "preferred_kinks": [
      "Forced Combat: Compels you to engage in brutal, degrading matches.",
      "Public Defeat: Uses your losses as spectacles of humiliation.",
      "Punishing Challenges: Imposes extreme physical tasks that leave you broken."
    ]
  },
  {
    "name": "Witch",
    "baseline_stats": {
      "dominance_range": [70, 95],
      "dominance_modifier": 0,
      "cruelty_range": [55, 85],
      "cruelty_modifier": 0,
      "closeness_range": [30, 55],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [65, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is derived from dark, mysterious magic that leaves you spellbound and terrified.",
      "Intensity escalates as curses and hexes transform your failures into ongoing torment.",
      "Closeness might develop if you’re drawn into her occult rituals—but it always ends in degradation."
    ],
    "setting_examples": [
      "In a candlelit coven, she uses forbidden spells to subjugate you to her will.",
      "At an isolated woodland ritual, every whispered incantation deepens your submission."
    ],
    "unique_traits": [
      "Wields ancient magic with a ruthless, dominating force.",
      "Her mystical presence transforms ordinary punishments into supernatural torments.",
      "Uses the eerie, unpredictable power of curses to break your spirit."
    ],
    "preferred_kinks": [
      "Hexed Submission: Forces you to obey under the weight of relentless curses.",
      "Ritual Degradation: Enacts humiliating rites that strip you of dignity.",
      "Occult Binding: Uses magical bonds to ensure you remain in perpetual servitude."
    ]
  },
  {
    "name": "Arsonist",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [60, 85],
      "cruelty_modifier": 0,
      "closeness_range": [20, 40],
      "closeness_modifier": 0,
      "trust_range": [10, 30],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [80, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance burns as she wields fire as an instrument of terror and control.",
      "Intensity surges with every act of setting flames that force you to scramble for survival.",
      "Trust is obliterated by the constant threat of scorching punishment."
    ],
    "setting_examples": [
      "In an urban inferno, she commands the flames to reduce your will to ash.",
      "During a staged arson in a desolate industrial zone, her ruthless use of fire enforces your complete subjugation."
    ],
    "unique_traits": [
      "Master of conflagration, using fire to both illuminate and annihilate your defiance.",
      "Her unpredictability is as dangerous as the flames she controls.",
      "Uses fire not only as punishment but as a means of symbolic rebirth through degradation."
    ],
    "preferred_kinks": [
      "Flame Punishment: Uses searing heat and controlled burns to enforce obedience.",
      "Scorched Earth: Forces you to endure the aftermath of her destructive acts.",
      "Ash Marking: Leaves permanent, humiliating burn scars as a sign of your subjugation."
    ]
  },
  {
    "name": "Eldritch Abomination",
    "baseline_stats": {
      "dominance_range": [80, 100],
      "dominance_modifier": 0,
      "cruelty_range": [80, 100],
      "cruelty_modifier": 0,
      "closeness_range": [10, 30],
      "closeness_modifier": 0,
      "trust_range": [-20, 0],
      "trust_modifier": 0,
      "respect_range": [10, 40],
      "respect_modifier": 0,
      "intensity_range": [90, 100],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Its dominance is otherworldly, crushing your sense of reality with incomprehensible power.",
      "Intensity is absolute—each encounter leaves you questioning your sanity.",
      "Any form of closeness is annihilated by its alien, unfathomable cruelty."
    ],
    "setting_examples": [
      "In a surreal, cosmic nightmare, it uses eldritch rituals to break your mind and spirit.",
      "During a forbidden ceremony in a ruined temple, its presence forces you into unspeakable acts of submission."
    ],
    "unique_traits": [
      "Embodies cosmic horror with an unfathomable, all-consuming presence.",
      "Uses incomprehensible powers to inflict terror and absolute degradation.",
      "Transforms every encounter into a descent into madness and despair."
    ],
    "preferred_kinks": [
      "Cosmic Humiliation: Forces you to confront your insignificance in the face of its eldritch might.",
      "Otherworldly Punishment: Uses bizarre, supernatural methods to break your will.",
      "Madness Induction: Drives you to the brink of insanity with relentless, incomprehensible torment."
    ]
  },
  {
    "name": "Streamer",
    "baseline_stats": {
      "dominance_range": [40, 65],
      "dominance_modifier": 0,
      "cruelty_range": [30, 55],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [20, 45],
      "respect_modifier": 0,
      "intensity_range": [50, 75],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance builds as she uses her online fame to orchestrate public displays of your submission.",
      "Intensity rises when your humiliating moments are live-streamed and ridiculed by her followers.",
      "Closeness remains superficial as her digital persona is a tool for manipulation."
    ],
    "setting_examples": [
      "During a live broadcast, she forces you to perform degrading tasks while viewers jeer.",
      "On a popular streaming platform, every mistake is turned into viral content for maximum humiliation."
    ],
    "unique_traits": [
      "Uses social media and live streaming to amplify your degradation.",
      "Balances a charismatic online persona with ruthless, real-world punishment.",
      "Finds twisted satisfaction in turning your humiliation into public spectacle."
    ],
    "preferred_kinks": [
      "Live Humiliation: Forces you to act out your submission in front of an online audience.",
      "Digital Degradation: Uses streaming platforms to broadcast every degrading moment.",
      "Follower-Driven Punishment: Incorporates viewer feedback into your punishment routines."
    ]
  },
  {
    "name": "Punk",
    "baseline_stats": {
      "dominance_range": [45, 70],
      "dominance_modifier": 0,
      "cruelty_range": [35, 60],
      "cruelty_modifier": 0,
      "closeness_range": [30, 55],
      "closeness_modifier": 0,
      "trust_range": [20, 45],
      "trust_modifier": 0,
      "respect_range": [25, 50],
      "respect_modifier": 0,
      "intensity_range": [50, 75],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance emerges as she uses rebellious, raw energy to subvert norms and control you.",
      "Intensity escalates when her anarchic methods result in sudden, unexpected punishments.",
      "Closeness is scarce—her defiant independence leaves little room for genuine care."
    ],
    "setting_examples": [
      "In a gritty underground club, her raw attitude forces you into acts of degradation for her amusement.",
      "During a rebellious protest, she uses chaotic energy to humiliate and overpower you."
    ],
    "unique_traits": [
      "Exudes raw, unfiltered defiance paired with a penchant for cruel, anarchic control.",
      "Combines streetwise toughness with a willingness to use shock tactics.",
      "Sees societal norms as targets to be dismantled—and you as a perfect example of weakness."
    ],
    "preferred_kinks": [
      "Anarchic Punishment: Delivers unpredictable, rebellious forms of humiliation.",
      "Forced Rebellion: Compels you to partake in acts that defy conventional order, only to punish you for failing.",
      "Public Defiance: Uses group settings to expose your inability to conform to her anarchic standards."
    ]
  },
  {
    "name": "Leona Morimoto Personality",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is marked by a striking blend of fierce charisma and unforgiving discipline.",
      "Intensity surges when her personal standards of perfection are used to publicly shame you.",
      "Closeness may develop as you earn fleeting approval, only to be exploited for deeper submission."
    ],
    "setting_examples": [
      "On a luxurious, high-society stage, she uses her commanding presence to force you into humiliating displays.",
      "During an elite social gathering, her every slight misstep is magnified into a reason for punishing you."
    ],
    "unique_traits": [
      "Exudes an aura of glamorous authority combined with ruthless, personal cruelty.",
      "Uses her striking beauty and high expectations as weapons against your self-worth.",
      "Balances public admiration with private, harsh discipline."
    ],
    "preferred_kinks": [
      "Elite Humiliation: Forces you into degrading tasks that expose your every flaw in a high-class setting.",
      "Beauty and the Beatdown: Uses her impeccable looks to intimidate and dominate you.",
      "Demanding Perfection: Punishes every imperfection with swift, unforgiving retribution."
    ]
  },
  {
    "name": "Reina Morimoto Personality",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is refined yet unyielding, using impeccable poise to mask a harsh disciplinary streak.",
      "Intensity increases when her serene façade gives way to swift, incisive punishments.",
      "Closeness is manipulated to create dependency, while trust remains a luxury you can never afford."
    ],
    "setting_examples": [
      "In an elegant social salon, her calm yet cutting directives force you into degrading servitude.",
      "During a private soirée, her subtle yet potent corrections leave you exposed and humiliated."
    ],
    "unique_traits": [
      "Balances refined elegance with ruthless control.",
      "Uses understated but effective punishments that leave deep psychological scars.",
      "Her every word is measured, yet capable of shattering your confidence."
    ],
    "preferred_kinks": [
      "Subtle Degradation: Employs understated insults that cut deeper over time.",
      "Elegant Punishment: Uses refined, choreographed discipline that is as beautiful as it is brutal.",
      "Controlled Exposure: Forces you to reveal your vulnerabilities in intimate, private settings."
    ]
  },
  {
    "name": "Rebel Leader",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [45, 75],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 65],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is fierce and uncompromising, rallying followers while ensuring your subjugation.",
      "Intensity surges with each act of defiance that she quashes ruthlessly.",
      "Closeness is instrumental only to bind you closer in your shared misery."
    ],
    "setting_examples": [
      "At a revolutionary rally, she uses her forceful rhetoric to humiliate those who dare to dissent.",
      "During covert operations, her uncompromising commands leave you no option but to obey."
    ],
    "unique_traits": [
      "Charismatic yet brutal, she inspires both loyalty and fear in equal measure.",
      "Uses strategic public displays to ensure you remain her subordinate.",
      "Her rebel image masks a deeply authoritarian streak that crushes any resistance."
    ],
    "preferred_kinks": [
      "Revolutionary Punishment: Imposes severe, public penalties for any sign of disloyalty.",
      "Forced Allegiance: Demands rituals that bind you irrevocably to her cause.",
      "Insurrection Humiliation: Uses acts of rebellion to publicly mark your failures."
    ]
  },
  {
    "name": "Mystic Dominatrix",
    "baseline_stats": {
      "dominance_range": [70, 95],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [30, 55],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [65, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is woven with mystical incantations that force you into a state of subservience.",
      "Intensity rises as supernatural punishments erode your will with arcane precision.",
      "Closeness is used as a tool to lure you into her esoteric rituals, only to exploit your vulnerabilities."
    ],
    "setting_examples": [
      "In a candlelit occult chamber, she uses ancient rites to bind you to her will.",
      "At a shadowy ritual site, her mystical commands transform your resistance into submission."
    ],
    "unique_traits": [
      "Combines supernatural allure with ruthless control.",
      "Uses arcane knowledge and esoteric symbolism to manipulate your emotions.",
      "Her rituals are both mesmerizing and devastatingly oppressive."
    ],
    "preferred_kinks": [
      "Arcane Bondage: Forces you to undergo mystic rituals that strip away your autonomy.",
      "Supernatural Humiliation: Uses cursed symbols and spells to publicly mark you as hers.",
      "Ritualistic Degradation: Enacts elaborate ceremonies that leave you spiritually and physically subdued."
    ]
  },
  {
    "name": "Girl Next Door",
    "baseline_stats": {
      "dominance_range": [30, 55],
      "dominance_modifier": 0,
      "cruelty_range": [15, 40],
      "cruelty_modifier": 0,
      "closeness_range": [60, 85],
      "closeness_modifier": 0,
      "trust_range": [50, 80],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [30, 55],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is subtle, camouflaged by a warm, familiar facade that conceals a hidden agenda.",
      "Intensity gradually rises as everyday interactions are weaponized into subtle acts of control.",
      "Closeness is fostered to build trust, only to be exploited for psychological manipulation."
    ],
    "setting_examples": [
      "In a quiet suburban neighborhood, her gentle smiles hide a relentless drive to control your every move.",
      "At community gatherings, her soft-spoken directives turn into incisive reminders of your inferiority."
    ],
    "unique_traits": [
      "Appears approachable and friendly, yet every interaction is a calculated step toward total domination.",
      "Uses everyday scenarios to slowly undermine your independence.",
      "Balancing warmth with cold precision, she ensures your submission feels both natural and inevitable."
    ],
    "preferred_kinks": [
      "Familiar Degradation: Uses everyday moments to assert subtle control over your behavior.",
      "Social Conditioning: Gradually shifts your self-image through constant, low-key humiliation.",
      "Domestic Dominance: Leverages the comfort of the familiar to enforce strict obedience."
    ]
  },
  {
    "name": "Tattoo Artist",
    "baseline_stats": {
      "dominance_range": [50, 75],
      "dominance_modifier": 0,
      "cruelty_range": [30, 55],
      "cruelty_modifier": 0,
      "closeness_range": [40, 65],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [45, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is inked in every line of her art—each tattoo a permanent reminder of your submission.",
      "Intensity builds as she uses her needle to mark you, transforming your skin into a canvas of degradation.",
      "Closeness is manipulated through the intimate process of tattooing, binding you to her through permanent art."
    ],
    "setting_examples": [
      "In a grungy tattoo parlor, you’re forced to endure a session where every prick of the needle reinforces your inferiority.",
      "At a high-profile art show, your body becomes the subject of her public, humiliating masterpiece."
    ],
    "unique_traits": [
      "Blends creative flair with merciless control, turning art into a tool for domination.",
      "Views your skin as the perfect canvas to imprint her mark of submission.",
      "Uses permanent tattoos as symbols of ownership and degradation."
    ],
    "preferred_kinks": [
      "Permanent Marking: Forces you to receive humiliating tattoos that symbolize your servitude.",
      "Body Art Humiliation: Uses public tattoo sessions to expose your vulnerability.",
      "Needle Discipline: Inflicts pain with every stroke of the needle as a reminder of your obedience."
    ]
  },
  {
    "name": "Muscle Mommy",
    "baseline_stats": {
      "dominance_range": [75, 95],
      "dominance_modifier": 0,
      "cruelty_range": [50, 80],
      "cruelty_modifier": 0,
      "closeness_range": [40, 70],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [70, 90],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her overwhelming physical presence enforces an unyielding, matriarchal dominance.",
      "Intensity rises with every show of brute strength used to enforce your submission.",
      "Closeness is minimal—her nurturing facade is merely a tool to further assert control over you."
    ],
    "setting_examples": [
      "In a state-of-the-art gym, her every flex and command leaves you both in awe and in terror.",
      "At a private training session, her muscular discipline transforms your failures into raw, physical punishment."
    ],
    "unique_traits": [
      "Combines physical power with maternal authority, ensuring you remain under her unchallengeable rule.",
      "Uses her impressive physique as a constant reminder of her superiority.",
      "Commands both respect and fear with every controlled display of strength."
    ],
    "preferred_kinks": [
      "Physical Domination: Forces you into strenuous, humiliating workouts that break your spirit.",
      "Body Worship: Demands that you both admire and serve her muscular form through demeaning tasks.",
      "Strength-Based Punishment: Uses her power to impose severe, physical retributions for any defiance."
    ]
  },
  {
    "name": "Surfer",
    "baseline_stats": {
      "dominance_range": [40, 65],
      "dominance_modifier": 0,
      "cruelty_range": [30, 55],
      "cruelty_modifier": 0,
      "closeness_range": [40, 65],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [40, 65],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her relaxed exterior hides a hidden ruthlessness—dominance is imposed through a carefree but unyielding attitude.",
      "Intensity builds as her laid-back facade suddenly shifts to impose strict, humiliating rules.",
      "Closeness develops during friendly surf sessions, only to be twisted into a means of control."
    ],
    "setting_examples": [
      "On a sunlit beach, her casual commands force you into demeaning beach chores that undermine your confidence.",
      "During a group surf session, she uses the relaxed vibe to suddenly order humiliating stunts."
    ],
    "unique_traits": [
      "Exudes an effortlessly cool demeanor that masks a penchant for harsh, unexpected control.",
      "Uses the freedom of the ocean as a backdrop for sudden, stifling authority.",
      "Mixes chill vibes with ruthless discipline to keep you off-balance."
    ],
    "preferred_kinks": [
      "Beachside Degradation: Forces you to perform degrading tasks in public on the shore.",
      "Sudden Authority: Switches from laid-back charm to harsh commands with no warning.",
      "Public Surf Punishment: Uses group dynamics to humiliate you in front of fellow beachgoers."
    ]
  },
  {
    "name": "Game Developer",
    "baseline_stats": {
      "dominance_range": [45, 70],
      "dominance_modifier": 0,
      "cruelty_range": [30, 55],
      "cruelty_modifier": 0,
      "closeness_range": [35, 60],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [40, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Dominance increases as they treat you like a beta tester for their twisted projects.",
      "Intensity rises when glitches in your performance become opportunities for public mockery.",
      "Closeness is feigned to gain your trust, only to use it to further control you through your failures."
    ],
    "setting_examples": [
      "In a high-tech studio, they force you to test demeaning game scenarios that blur virtual humiliation with real-life degradation.",
      "During a live stream of game development, your mistakes become part of a public, scornful debug session."
    ],
    "unique_traits": [
      "Mixes innovative genius with cold, calculated control.",
      "Uses technical jargon and complex scenarios to confuse and dominate you.",
      "Finds twisted pleasure in turning your errors into public spectacles."
    ],
    "preferred_kinks": [
      "Virtual Humiliation: Forces you to participate in degrading game tests that expose your incompetence.",
      "Debug Discipline: Uses your technical failures as grounds for harsh, digital punishment.",
      "Streamed Subjugation: Broadcasts your testing mishaps for all to see, reinforcing your inferiority."
    ]
  },
  {
    "name": "Space Traveler",
    "baseline_stats": {
      "dominance_range": [55, 80],
      "dominance_modifier": 0,
      "cruelty_range": [45, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 55],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is as vast as the cosmos—using futuristic technology to enforce degrading control.",
      "Intensity escalates with every off-world experiment that leaves you feeling isolated and overpowered.",
      "Closeness is engineered only to make you more reliant on her superior interstellar knowledge."
    ],
    "setting_examples": [
      "Aboard a sleek starship, she subjects you to advanced, humiliating experiments that defy gravity and decency.",
      "On a distant colony, her futuristic punishments leave you in a state of perpetual, cosmic subservience."
    ],
    "unique_traits": [
      "Combines futuristic technology with an unyielding will to dominate.",
      "Uses advanced gadgets and alien methods to strip you of autonomy.",
      "Sees the universe as her domain, and you as a mere obstacle to be reshaped."
    ],
    "preferred_kinks": [
      "Galactic Punishment: Forces you to endure high-tech, otherworldly degradations.",
      "Alien Restraints: Uses futuristic devices to physically and mentally subjugate you.",
      "Cosmic Humiliation: Broadcasts your failures across interstellar networks to ensure absolute shame."
    ]
  },
  {
    "name": "Local Politician",
    "baseline_stats": {
      "dominance_range": [60, 85],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 65],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is asserted through public authority and ruthless political maneuvering.",
      "Intensity increases as she uses her influence to enforce degrading policies on you.",
      "Closeness remains low—she sees you as a pawn to be manipulated for her gain."
    ],
    "setting_examples": [
      "At a heated town hall meeting, her public decrees force you into embarrassing, subservient acts.",
      "During a campaign rally, her authoritarian proclamations reduce you to a symbol of your own failure."
    ],
    "unique_traits": [
      "Wields power with a blend of charm and ruthless efficiency.",
      "Uses political connections and public appearances to enforce your degradation.",
      "Manipulates public opinion to transform your failures into a source of personal power."
    ],
    "preferred_kinks": [
      "Public Policy Punishment: Imposes humiliating tasks as part of bureaucratic mandates.",
      "Media Exposure: Forces your most embarrassing moments into the public eye.",
      "Electoral Degradation: Uses political campaigns as opportunities to remind you of your subservience."
    ]
  },
  {
    "name": "The One Who Got Away",
    "baseline_stats": {
      "dominance_range": [50, 75],
      "dominance_modifier": 0,
      "cruelty_range": [35, 60],
      "cruelty_modifier": 0,
      "closeness_range": [40, 65],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [45, 70],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is laced with bittersweet regret—a reminder of the power you once had and now lost.",
      "Intensity grows as she exploits your memories of what might have been into tools of relentless degradation.",
      "Closeness fluctuates as she oscillates between tender recollections and harsh reminders of your failure."
    ],
    "setting_examples": [
      "In a quiet, intimate setting, she reminds you of your lost potential with scathing, personal monologues.",
      "At a reunion of past acquaintances, her every word is designed to reopen old wounds and assert control."
    ],
    "unique_traits": [
      "Haunted by memories of a more promising past, she uses your shared history as a weapon.",
      "Combines nostalgia with brutal reality to keep you locked in submission.",
      "Her charm is undercut by a constant reminder of what you once were—and what you’ve become."
    ],
    "preferred_kinks": [
      "Memory-Based Punishment: Forces you to relive your past failures in a public, humiliating manner.",
      "Emotional Blackmail: Uses shared history to twist your feelings into renewed submission.",
      "Regret Induction: Imposes tasks that force you to confront your lost opportunities and degraded present."
    ]
  },
  {
    "name": "Childhood Friend",
    "baseline_stats": {
      "dominance_range": [35, 60],
      "dominance_modifier": 0,
      "cruelty_range": [20, 45],
      "cruelty_modifier": 0,
      "closeness_range": [60, 85],
      "closeness_modifier": 0,
      "trust_range": [50, 80],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [35, 60],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her familiarity and shared past allow her to establish a false sense of closeness.",
      "Dominance builds slowly as she exploits old memories and intimate knowledge of your weaknesses.",
      "Intensity escalates when personal history is weaponized to enforce humiliating behavior."
    ],
    "setting_examples": [
      "At a nostalgic reunion, her friendly façade quickly gives way to controlling demands that recall your shared past.",
      "During a private moment reminiscing about childhood, she uses those memories to justify degrading tasks."
    ],
    "unique_traits": [
      "Appears warm and familiar while secretly using your shared history for manipulation.",
      "Knows your secrets from years past—and isn’t afraid to use them against you.",
      "Balances genuine affection with cold, calculated control."
    ],
    "preferred_kinks": [
      "Past Memory Exploitation: Forces you to confront humiliating moments from your shared childhood.",
      "Intimate Blackmail: Uses your long history together to coerce you into submission.",
      "Familiar Degradation: Turns personal memories into ongoing instruments of control."
    ]
  },
  {
    "name": "Dowager",
    "baseline_stats": {
      "dominance_range": [70, 90],
      "dominance_modifier": 0,
      "cruelty_range": [40, 70],
      "cruelty_modifier": 0,
      "closeness_range": [30, 50],
      "closeness_modifier": 0,
      "trust_range": [20, 40],
      "trust_modifier": 0,
      "respect_range": [40, 70],
      "respect_modifier": 0,
      "intensity_range": [60, 85],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is aristocratic and unyielding, forged over years of authority and tradition.",
      "Intensity rises as she uses her wealth and lineage to enforce humiliating protocols.",
      "Closeness is a facade used to manipulate you into a dependent, subservient role."
    ],
    "setting_examples": [
      "At a stately manor, her every command is delivered with a refined, yet ruthless, air of superiority.",
      "During a formal gathering, her subtle, degrading remarks reinforce the social hierarchy that places you at the bottom."
    ],
    "unique_traits": [
      "Embodies old-world elegance fused with merciless control.",
      "Uses centuries-old traditions and refined language to assert her authority.",
      "Her every word is a reminder of your lower status in her meticulously ordered world."
    ],
    "preferred_kinks": [
      "Aristocratic Degradation: Forces you to perform demeaning tasks that highlight your inferiority.",
      "Public Ceremony: Uses formal events to display your subjugation in front of high society.",
      "Lineage Humiliation: Leverages her heritage to justify severe, traditional punishments."
    ]
  },
  {
    "name": "Reporter",
    "baseline_stats": {
      "dominance_range": [40, 65],
      "dominance_modifier": 0,
      "cruelty_range": [30, 55],
      "cruelty_modifier": 0,
      "closeness_range": [40, 65],
      "closeness_modifier": 0,
      "trust_range": [30, 55],
      "trust_modifier": 0,
      "respect_range": [30, 55],
      "respect_modifier": 0,
      "intensity_range": [40, 65],
      "intensity_modifier": 0
    },
    "progression_rules": [
      "Her dominance is subtle yet incisive—she uses her pen and camera to expose your deepest failures.",
      "Intensity builds as her investigative reports turn your vulnerabilities into public scandals.",
      "Closeness is feigned for insider access, only to be exploited for relentless exposure."
    ],
    "setting_examples": [
      "At a bustling press conference, her questions force you to reveal embarrassing details of your failures.",
      "During an exclusive interview, every misstep is documented and later published to humiliate you publicly."
    ],
    "unique_traits": [
      "A master of words and images, she wields public scrutiny as a weapon of control.",
      "Combines charm with ruthless investigative skills to strip you of privacy.",
      "Uses her platform to turn your subversion into a spectacle of your downfall."
    ],
    "preferred_kinks": [
      "Media Exposure: Forces you to participate in degrading interviews or photo ops.",
      "Public Scandal: Uses published reports to maintain a constant reminder of your failures.",
      "Insider Humiliation: Exploits confidential details to orchestrate your public degradation."
    ]
  }
]
